{
  "version": "https://jsonfeed.org/version/1",
  "title": "oscarryz blog",
  "home_page_url": "https://oscarryz.now.sh",
  "feed_url": "https://oscarryz.now.sh/feed/json",
  "icon": "https://oscarryz.now.sh/img/favicon.ico",
  "author": {
    "name": "OscarRyz",
    "url": "https://twitter.com/oscarryz"
  },
  "items": [
    {
      "id": "f9caceb0-dd33-11ea-ad7e-bfb0df3ce950",
      "title": "Star gazing",
      "content_html": "<h1>Star gazing</h1><h5>August 13th, 2am</h5><p>It took me three days but finally today I was able to watch shooting stars.</p><p>I grew up in a place where going out after 8pm requires you to wear a sweater, no matter the time of the year, and definitely at least three layers after midnight. Now I live in Texas and my brain struggles to understand it's 30C (86f) at 2 am. I for one am glad as I could pull a chair in the garden and layback to watch the sky.</p><p>Now, when they say “meteor shower” what comes to mind? Meteorites falling as rain, am I right? Nothing even close. But definitely much more than what one could expect to see by just turning your head up to the sky.</p><p>It's a fun experience, at the beginning it's confusing, you're there and absolutely nothing happens. Then the night sounds started to freak me out, the wind blowing in the trees, the crickets, the creaking on the neighbor fence, and even the AC turning on and off make me wanted to run back into the house. Then it hits me, all of these things still happen without me while I’m sleeping. These night things welcome me into their world by just ignoring me and accepting me as I am.</p><p>So I relax a bit and start to feel comfortable, but still nothing happens. Then there it is! A first shooting star, although I immediately start wondering if I imagined it, it was way too brief and too dim, nothing like some others I’ve seen before. Oh well.</p><p>20 minutes in, check my phone app to see (for the 10th time) where the perseids are located and while I’m moving my sight into the screen I see another one, very clear! very bringht!. Ok ok, put the phone away and get ready to be amazed by the rest of the stars. Nothing happens.</p><p>So, things start getting a bit uncomfortable, I’m wearing pants and long sleeve in a 30c (86f) weather due to the mosquitoes, so I’m sweating a bit. My hands (the only uncovered part besides my face) start getting a bit itchy, a mosquito must have found it’s way there. I’m starting to worry about the possibility of having putt the chair in the middle of an ant “house”, and I’ve just seen 1 1/2 star.</p><p>“Come on! where are they?” I ask my self knowing (but not accepting) that I need to be patient.  I take a councious deep breath and realize all of this is part of the experience, the being in the middle of the yard , in the dark, my head leaning back. So I cover my hands a bit more, lay back  and enjoy the moment. I hear the same night sounds but now they’re just like a lullaby, the craking on the fence it’s not scary anymore, it’s just a rythmic sound. The wind on the trees, which is a sound I adore in the day, it’s even delightful in the night. I hear some dogs barking very far away and I compare them to those where I grew up. There are some other sounds whose source I cannot fully detect but they’re fine I stop trying to figure out where the come from.</p><p>40 minutes in and finally I stopped trying to make things happen just because I want to. They’ll just happen when they have to. I just have to be present. So I start prepering my whishes for the upcoming stars as I know they’ll show up. And a few minutes later there was one, and another, and another. Some of them dim and shy, that last one I saw, about the brighthest I’ve ever seen, 4 seconds crossing the sky.</p><p>One hour after and many whishes for all my loved ones after, I walk back to the house. The moon is about to show up and Illuminate the sky. Got into the house and enjoy all the other things tha sleep in there.</p><p>This has been a very nice star gazing night.</p>\n",
      "url": "https://oscarryz.now.sh/star-gazing.html",
      "date_modified": "2020-08-13T08:13:40.048Z"
    },
    {
      "id": "85e60ea0-dccb-11ea-ad7e-bfb0df3ce950",
      "title": "Physical Work",
      "content_html": "<h1>Physical Work</h1><p>It may seem obvious, but I think it’s important to remember how hard physical work is. </p><p>In a modernized world, it’s easy to take granted things farming, mining, construction, or even more mundane activities like mowing the lawn or cleaning the house. But we have been doing physical work since the beginnings of human history.</p><p>Physical work dignifies and envigorates; there is something about it that is different from say, training or working out. Seeing the final product and get tired at the end of the day seems a bit of a reward in itself.</p><p><br /></p>\n",
      "date_published": "2020-08-12T18:42:07.114Z",
      "url": "https://oscarryz.now.sh/physical-work.html",
      "date_modified": "2020-08-12T18:42:07.114Z"
    },
    {
      "id": "d5030480-da13-11ea-ad7e-bfb0df3ce950",
      "title": "Continuous improvement",
      "content_html": "<h1>Continuous improvement</h1><p>I’m really impressed by people that do <strong>A LOT</strong> of work; think of someone that has written an 8 series book or ran an <a href=\"https://en.wikipedia.org/wiki/Ultramarathon\">ultramarathon</a> or learned all Chopin’s piano pieces, all of them.</p><p>The common trait all of these people have is perseverance and consistency, these milestones are more often than not achieved through continuous and consistent work. Of course, natural ability makes it easier but that just takes you so far. This daily work combined with analysis to remove deficiencies creates a continuous and constant improvement that eventually develops into mastery.</p><p>But how do you get this consistency? How you force yourself to do something <em>every day?</em> You just do it? Are you forced by an external force (your parents when you’re a child and then your obligations when grown-up?). I think I know the answer, I think I’ve always had. But it’s slightly different to know the path and walk the path.</p><p>I can also just sit here comfortably and see if an alternative method appears all of the sudden in front of me.</p>\n",
      "url": "https://oscarryz.now.sh/continuous-improvement.html",
      "date_modified": "2020-08-09T08:31:46.623Z"
    },
    {
      "id": "103d43e0-d572-11ea-ad7e-bfb0df3ce950",
      "title": "Always learning",
      "content_html": "<h1>Always learning</h1><h6>Aug 3rd, 2020</h6><p>We are like no other specie, always curious about our surroundings, we are from a few weeks after being born, always trying to learn and understand how things work. Probably this curiosity slows down as we get older, but as far as I’m concerned I’m still trying to learn as much as possible.</p><p>This trait has been exploited by the current state of the Internet, specifically \"Social Media”, we are always trying to find more information everywhere and these companies are pushing content we were not even interested on in the first place, and we, animals of habit find hard to disregard them.</p><p>And yet, we keep eager to learn new things, it just seems there are no suitable tools to enable us to satisfy this curiosity without turning us into mindless manipulated entities. Some tools like note-taking apps and knowledge tools come to mind (Notion, Evernote, Google Docs), even things like creating your own blog to preserve your thoughts (like I’m doing with this one) might help, but they will never be as easy as going to _____ app and scroll infinitely just looking for another spike of dopamine.</p><p>There most be a way of course. Probably it’s just as simple as turning off the device and see the world around us. But we are probably afraid to think that without “likes” and “follows” we are all alone.</p>\n",
      "url": "https://oscarryz.now.sh/always-learning.html",
      "date_modified": "2020-08-03T10:21:31.910Z"
    },
    {
      "id": "c92dbf30-d0e8-11ea-ad7e-bfb0df3ce950",
      "title": "English is not my native langu",
      "content_html": "<h1>English is not my native language</h1><p>So, if you spot a grammatical error here, please send me a message and I’ll fix it.</p><p>I’m currently in that weird spot where my thoughts are in English, I feel more comfortable speaking it and yet, I make some silly mistakes. </p><p>The worst part is sometimes when I switch to my native I run out of words too.</p>\n",
      "date_published": "2020-07-28T15:41:21.443Z",
      "url": "https://oscarryz.now.sh/english-is-not-my-native-langu.html",
      "date_modified": "2020-07-28T15:41:21.443Z"
    },
    {
      "id": "05c92440-cfc0-11ea-ad7e-bfb0df3ce950",
      "title": "Why should we try to be a bett",
      "content_html": "<h1>Why should we try to be a better person</h1><p>Why? Is it because if we don't try, we drift to worsen? What defines what's better or worse? Is it subjective? Cultural? A social construct?</p><p>Assuming the meaning of life if to enjoy it, the better we are, the better the opportunities to enjoy it will be.</p><p>For example, let's take sleeping all day long; we can argue that's something enjoyable and thus a good thing to do, but by doing it in excess, we would miss chances to do something else. In this case, not sleeping all day would make us better. What if, we insist, that sleeping is what we want to do. In that case, that wouldn't be a problem and would be the rare case of someone who found what they want to do for the rest of their life. The reality, however, is not that simple. We need to do something else (go to work to buy food, make food, eat, etc.).</p><p>That's why good habits, like sleep well, healthy food, exercise, among many others, are deemed as good things as they enable us to enjoy life better, a healthy, well-slept body will enjoy a sunset better than one with sleep deprivation.</p><p>When we become self-sufficient, we enable ourselves to give us more opportunities to enjoy life (making yourself your favorite food is an example).</p><p>That's why I think we should try to be better persons because, in the end, it benefits ourselves. It seems so obvious isn’t it?</p><p>We don't get better overnight though it takes time to develop these skills and habits, hence the improvement is always an ongoing gradual process. There's no rush, but there's no reason to delay it either.</p><p>More often than not, the things we do to be better are also themselves the reward to enjoy life.</p>\n",
      "url": "https://oscarryz.now.sh/why-should-we-try-to-be-a-bett.html",
      "date_modified": "2020-07-28T15:36:14.164Z"
    },
    {
      "id": "9bec8ae0-c93d-11ea-966a-0332a7d703ce",
      "title": "Choose to remember",
      "content_html": "<h1>Choose to remember</h1><p>Never like before we have had the opportunity to capture our experiences as we go.</p><p>We have devices (phones but they are not really \"phones\" anymore) where we can capture video, take photos and write notes at any given time.</p><p>The problem is these devices are also a distracting tool that alienates us from living the present moment.</p><p>Still, the ability to capture memories overweights the downsides. However, a tool to better organize these memories in a way the human brain does is still needed. It's not a very complex problem, but not trivial.</p>\n",
      "date_published": "2020-07-18T21:28:23.439Z",
      "url": "https://oscarryz.now.sh/choose-to-remember.html",
      "date_modified": "2020-07-18T21:28:23.440Z"
    },
    {
      "id": "6e161ca0-c68e-11ea-90e2-ffb7e57b375c",
      "title": "How to get to sleep",
      "content_html": "<h1>How to get to sleep</h1><h6>July 15th, 2020</h6><p><em>Guarantee to work… almost</em></p><ol><li><p>Think of a fond memory of yours; it could be a trip, a childhood memory. Pretty much anything.</p></li><li><p>Try to remember the details, how did you get there, what happened the day before or a few moments earlier.</p></li><li><p>Remember the details of the event and let it flow into what happened next. Recreate it in your mind.</p></li><li><p>Remember who you were with, details about the place. What became of those people? What other memories do you have about that place?</p></li><li><p>Finally, stop trying to control the memories and let it flow.</p></li></ol><p>This works for me almost all the time. I find that while trying to remember those things I usually start dreaming about them and eventually fall asleep. Also, I stop thinking about other topics which are usually the reason why I can’t sleep in the first place. <br><br>And if it doesn’t work at least I’ve had a good time reliving those memories that otherwise get lost in the business of the everyday.</p>\n",
      "url": "https://oscarryz.now.sh/how-to-get-to-sleep.html",
      "date_modified": "2020-07-17T05:03:25.886Z"
    },
    {
      "id": "2364d850-c4f3-11ea-8106-5948db66e7b8",
      "title": "Online discussions",
      "content_html": "<h1>Online discussions</h1><p>Just like in real life, discussions are better when they are personal, with someone you know and when the parts already know how to have a civil discussion.</p><p>Otherwise, they are just a waste of time really. Sometimes is worth trying but bear in mind you won’t change someone’s mind, when that someone has a preconceived idea.</p><p>Obligatory <a href=\"https://xkcd.com/386/\" title=\"xkcd: Duty Calls\">xkcd</a>.</p>\n",
      "url": "https://oscarryz.now.sh/online-discussions.html",
      "date_modified": "2020-07-13T16:31:01.741Z"
    },
    {
      "id": "4f90b510-c3d7-11ea-9f72-413aa35f893d",
      "title": "It’s not just about happiness ",
      "content_html": "<h1>It’s not just about happiness though</h1><h5>July 11th, 2020</h5><p>We cannot pretend, however, that we can be <a href=\"/happiness.html\" title=\"\">happy</a> all the time. We are very complex creatures and we can have all sorts of emotions even when they seem contradictory, especially in times like these.</p><p>While is desirable to strive for happiness, it’s important to recognize and accept we can also be fearful, scared, anxious, etc. There’s nothing wrong with that. In the past , society has enforced stereotypes in which only the positive should be promoted and the negative suppressed. This is <a href=\"https://www.google.com/search?q=toxic+positivity\" title=\"\">toxic positivity</a> and even when well-intentioned it causes more damage than what it tries to help.</p><p>These “negative” feelings are also part of ourselves, and we cannot just ignore them and push them aside. For one, that would be denying our own human nature; secondly, they will find their way in sometimes unpredictable ways; and finally, they’re there for a reason, either to create awareness of our surroundings, serving as an alert, to stop doing something that’s damaging us, or enabling us to feel empathy and create a connection with others.</p>",
      "date_published": "2020-07-12T06:12:44.182Z",
      "url": "https://oscarryz.now.sh//its-not-just-about-happiness.html",
      "date_modified": "2020-07-12T06:12:44.182Z"
    },
    {
      "id": "b050b170-c026-11ea-b8f8-d52ffa796a70",
      "title": "Happiness",
      "content_html": "<h1>Happiness</h1><h6><strong>Jul 6, 2020</strong></h6><p>Happiness is not quantifiable, like money or time. You cannot say I have X amount of happiness.</p><p>Happiness is an absolute, you're happy and that's it! You cannot be more or less happy, the perceived amount of happiness is perhaps the amount of continuous-time you feel it (oftentimes manifested as Joy) but there are all kinds of sources of happiness; when you eat your favorite meal, when you had a good night of sleep, when you see a beautiful sunset, when you see the eyes of the person you love.</p><p>Some of the sources of happiness are quite obvious, like joy after a good laugh, but many of them are subtle and almost hidden everywhere else, like that warm feeling of a blanket on a cold night.</p><p>And this is the real meaning of life, this is why we're here for, to find and link together all these sources and keep the streak as long as possible.</p>",
      "date_published": "2020-07-12T00:12:07.202Z",
      "url": "https://oscarryz.now.sh//happiness.html",
      "date_modified": "2020-07-12T00:12:07.202Z"
    },
    {
      "id": "25e7d2f0-bd4e-11ea-b8f8-d52ffa796a70",
      "title": "About this blog",
      "content_html": "<h1>About this blog</h1><h5>Jul 1st, 2020</h5><p>It's just a place to write my extended thoughts about life (mainly digital life atm), inner replies to a post I read somewhere else, and yes, to reclaim my web presence and own my content among this sea of social networks, memes, cloud solutions, and whatnot.</p><p>What's funny is I tried to blog several times since forever, I have a Blogger account, a Medium account, even a <a href=\"https://proseful.com/\" title=\"Proseful\">Proseful</a> account. Never posted anything beyond the “hello world”.</p><p>I wasn't until I built this blog “engine” myself from the ground up that I get to use it, and I mean, really built it, no Gatsby, Jekyll, or static generators. Pure string concatenation (not saying this is good, but wanted to experiment how to do it).</p><p>There's no likes, analytics, comments, share button or alike (maybe I'll add those later). Just a link to my twitter in case someone wants to DM a reply, but that's not the intention.</p><p>I have it as a (really messy) <a href=\"https://github.com/oscarryz/manu\" title=\"Manu in Github\">open source project</a> and keep learning while I build it (e.g. yesterday added support to toggle dark mode).</p><p>There's something special about crafting your stuff, I guess similar to when we used to build our bows and arrows; if they suck you suck, but you can go home and improve them. When they work you feel proud. That's something we've lost in our technological evolution and yet so innate to human nature, it still finds its way in such an abstract world like the Internet.</p>",
      "date_published": "2020-07-04T17:02:38.966Z",
      "url": "https://oscarryz.now.sh//about-this-blog.html",
      "date_modified": "2020-07-04T17:02:38.966Z"
    },
    {
      "id": "903765e0-bcdf-11ea-9599-d74d386fe755",
      "title": "Curating social media",
      "content_html": "<h1>Curating social media</h1><h5>July 2nd, 2020</h5><p>There’s&nbsp;<a href=\"https://www.indiehackers.com/post/antisocial-media-60ebd9250e?commentId=-MAm-HJB318OskEhU6mZ\">this post</a>&nbsp;on indie hackers about how social media is currently more about trying to get people’s attention to what you think they might like:</p><blockquote><p>&nbsp;<em>On Facebook, you show others what you think they'll like. You spend time picking the best photo, edit your text to be snappy, agonize over the feedback you&nbsp;<strong>might</strong>&nbsp;get[…] I think that could be a remedy for the ills of social media - antisocial media. Time with oneself. Curating an environment... for you.</em></p></blockquote><p>A similar topic was addressed in this blog&nbsp;<a href=\"https://manuelmoreale.com/websites-and-complexity\">Websites and complexity</a>:</p><blockquote><p><em>At the same time though, it makes me kinda sad to see people giving up ownership of their web presence. Personal websites are a mirror of the human beings behind them.</em></p></blockquote><p><br>Makes me wonder; How many of the 2.2 billion (2,200+ million) users of Facebook are interested in customizing their profile and content to make it truly unique? I guess that many, I mean most of us don’t even post original content, we just repost what someone else’s did.</p><p>I know&nbsp;carrd.co&nbsp;offers a service to create your own web page. Let’s do a Google search. Oh wow,&nbsp;<a href=\"https://www.google.com/search?q=site:carrd.co\">200k results</a>!! That’s quite a number. I guess there’s some interest after all.&nbsp;<br>That’s still the 0.01 percent&nbsp; of the Facebook users, but then again, how many of them know about carrd.co?</p><p>The other aspect people might be interested on, is curating the content (not so much the appearance of the site) to keep track of their thoughts, photos, memories. Personal things. I don’t think there’s much out there except for all those note-taking apps and document management. Let’s see.</p><p>According to&nbsp;<a href=\"https://expandedramblings.com/index.php/evernote-statistics/\">this site</a>, there are 225 million Evernote users (obviously many of them are probably inactive, like the account I created years ago) that’s about 11 percent of Facebook users. Not bad at all.</p><p>Well it looks like people are indeed interested. It’s just mainstream social media is more prevalent and easier to use.</p><p>So, it seems people are willing to curate their content and tune the appearance of their profiles/sites after all.</p><p>Certainly, a topic to keep researching on.</p>",
      "date_published": "2020-07-03T05:15:16.201Z",
      "url": "https://oscarryz.now.sh//curating-social-media.html",
      "date_modified": "2020-07-03T05:15:16.201Z"
    },
    {
      "id": "597485a0-bc22-11ea-ab34-5981abea15dc",
      "title": "Ideas",
      "content_html": "<h1>Ideas</h1><p>You have an idea.</p><p>The idea doesn’t do anything, it’s just sitting there buzzing around your head.</p><p>Sometimes you speak out the idea. It becomes noise. Then if there’s someone around you and hear the idea they might like it and now they can use it, or just ignore it.</p><p>If the idea is not written down, it might be forgotten. If the idea is repeated out loud may shape into other ideas.</p><p>But ideas never turn into anything else if they are not put in practice.</p><p>I had an idea 10 years ago. Never did anything with it. Recently someone asked me:</p><p><em>“Hey, do you have a spare idea you’re not using?”</em></p><p>And suddenly I felt like using it again. I shared it. I created something with it (a drawing), now that idea is a drawing, until I turn it into something else.</p>",
      "date_published": "2020-07-03T02:54:11.298Z",
      "url": "https://oscarryz.now.sh//ideas.html",
      "date_modified": "2020-07-03T02:54:11.298Z"
    },
    {
      "id": "cd3b3950-babc-11ea-9080-e9046fc766e8",
      "title": "A Social Network without",
      "content_html": "<h1>A Social Network without</h1><h5>30 June 2020, 5:20 am</h5><p>Imagine a social network without advertisement</p><p>That doesn’t profile you</p><p>With no Likes or Followers</p><p>Without distraction machinery to make you crave for more</p><p>What you have left is what really matters, your own stories, your own memories, your own connection.<br><br><br><br><br><br><br><br><br><br><br></p>\n",
      "url": "https://oscarryz.now.sh/a-social-network-without.html",
      "date_modified": "2020-07-13T10:21:20.566Z"
    },
    {
      "id": "8640d660-9b70-11ea-8bb7-b3f8e9efdb6d",
      "title": "r/manuelmoreale",
      "content_html": "<h1>r/manuelmoreale</h1><h5>May 21st 2020</h5><p>Thoughts on this manuemoreale’s blog <a href=\"https://manuelmoreale.com/on-random-interactions\" title=\"this post\">post</a>.</p><p>Mass social media (Facebook, Instagram, Twitter, et al) certainly creates a disconnection between what’s important in human communication in favor of advertisement and popularity. But they also offer a way to communicate with the OP.</p><p>There are alternatives to this, of course, the most basic is to add a comments section on the blog, but seems inadequate (had to create accounts, moderate, etc) and it might just not fit the blog style.</p><p>Another is to let the interested party (the audience) create a blog/site of its own and post the reply there (just like I’m doing now) but that’s not trivial at all, and it was already addressed <a href=\"https://manuelmoreale.com/websites-and-complexity\" title=\"\">previously here</a>.</p><p>Maybe a new type of platform is needed. Probably this not-knowing-each-other is a good thing in some extent, but in the meantime, I’m still adding this reply here.</p><h3>Or Reddit…</h3><p>Or, I can use another platform such as Reddit which is … well it’s reddit.</p><p>Let’s see how that goes.</p><p>The idea is to create <a href=\"https://www.reddit.com/r/manuelmoreale\" title=\"\">r/manuelmoreale</a> and then for every post on the blog, create an entry on the subreddit where the audience can comment.</p>",
      "date_published": "2020-07-02T05:02:22.209Z",
      "url": "https://oscarryz.now.sh//r-manuelmoreale.html",
      "date_modified": "2020-07-02T05:02:22.209Z"
    },
    {
      "id": "e6652020-5eb5-11ea-899e-37f41fb5f8ad",
      "title": "Finding coincidences",
      "content_html": "<h2>Finding coincidences</h2><h6>March 05 2020</h6><p><em>In reply to </em><a href=\"https://www.indiehackers.com/codemysoul\" title=\"\"><em>@codemysoul</em></a><em> post on </em><a href=\"https://www.indiehackers.com/post/new-way-of-blogging-da65509db8\" title=\"\"><em>this IH post</em></a></p><p>I do find coincidence on what you're saying. I personally don't blog that often (or if at all) The thinking of having to conform to \"conventional\" practices and adhere to certain style creates a bit of anxiety in me. What if what I'm writing is seems boring? What if my grammar is terrible? What if the content is all over the place?</p><p>Fortunately I came across this blog <a href=\"https://manuelmoreale.com/\" title=\"https://manuelmoreale.com/\">manuelmoreale.com</a> which is is a great source of inspiration for a different type social media content. Way simpler, no SEO goals, personal.</p><p>I also can relate to the \"graveyard\" folder situation. Many projects started and never finished because of lack of time and/or lack of definition of a MVP.</p><p>So, as a way of applying what I've learned in IH about creating and MVP and keep it minimum I created a clone of <a href=\"https://manuelmoreale.com/\" title=\"manuelmoreale.com/\">manuelmorale.com</a> blog, but this one could be edited <em>in situ</em>. Unfortunately I also wanted to experiment with \"extreme\" serverlessness and the editor only runs locally and publishes the generated static site, so no online demo, only the final output: <a href=\"https://manu.oscarryz.now.sh/\" title=\"https://manu.oscarryz.now.sh/\">https://manu.oscarryz.now.sh/</a></p><p>So that's my MVP for the same goal as yours, create something for myself.</p><p>I'm sorry if I'm just talking about myself. What I meant to say with all of this, is yes! I like your idea and I'm myself going to keep exploring on these different ways to do things.</p>",
      "date_published": "2020-05-22T03:17:35.467Z",
      "url": "https://oscarryz.now.sh//finding-coincidences.html",
      "date_modified": "2020-05-22T03:17:35.467Z"
    },
    {
      "id": "0ccfe070-5eab-11ea-857b-ed3954ab3a20",
      "title": "Creating a simplistic blogging",
      "content_html": "<h2>Creating a simplistic blogging platform</h2><h6>MARCH 4, 2020</h6><p>That was the goal of this project; create a simple way to create blogs where you can just start writing directly into the blog instead of having to go through a complex application or have to write in a weird format and then transform the blog somehow, like you do with static site generators.</p><p>The idea while good, turned out to be (as many things in software development) easier to say that actually execute. It wasn’t particularly hard, just a little bit cumbersome, mostly due the lack of time.</p><p>So, taking as “inspiration” the&nbsp;<a href=\"https://manuelmoreale.com/\">https://manuelmoreale.com/</a>&nbsp;blog, we came up with this “design”:</p><p><img src=\"https://raw.githubusercontent.com/oscarryz/manu/master/etc/Editor-View.png\" alt=\"Editor view of the blog platform\" title=\"Manu blog platform\" contenteditable=\"false\" draggable=\"true\">Which is basically the same ui but adding an editor bar to create new entries, edit them and publish them.</p><p>I’ll keep documenting the approach we took to write this down and how far we’ve got. This right here is the first entry on the working platform, and while still far from complete is now usable.</p>",
      "date_published": "2020-05-22T03:16:45.372Z",
      "url": "https://oscarryz.now.sh//creating-a-simplistic-blogging.html",
      "date_modified": "2020-05-22T03:16:45.372Z"
    }
  ]
}