{
  "version": "https://jsonfeed.org/version/1",
  "title": "oscarryz blog",
  "home_page_url": "https://oscarryz.com",
  "feed_url": "https://oscarryz.com/feed/json",
  "icon": "https://oscarryz.com/img/favicon.ico",
  "author": {
    "name": "OscarRyz",
    "url": "https://twitter.com/oscarryz"
  },
  "items": [
    {
      "id": "6fcf6f00-f385-11ef-ba7a-a95f2ae78262",
      "title": "There are times",
      "content_html": "<h1>There are times</h1><p>When you just have to do it.<br /><br />There are times when you can think and analyze things, and that’s fine. Actually no, that’s necessary.</p><p>But when you have already analyzed all your options, as good as you can, there is no point trying to guess what’s going to happen next, just go and do it!</p>\n",
      "date_published": "2025-02-25T14:33:10.384Z",
      "url": "https://oscarryz.com/there-are-times.html",
      "date_modified": "2025-02-25T14:33:10.385Z"
    },
    {
      "id": "21656f30-efcb-11ef-b8bf-0b2a9fd47173",
      "title": "Zettlelkasten method",
      "content_html": "<h1>Zettlelkasten method</h1><h2>How to</h2><ol><li><p><strong>Create a Fleeting Notes Inbox</strong></p><ul><li><p>Fleeting notes are raw, unprocessed notes.</p></li><li><p>Keep references to source material if deemed necessary</p></li><li><p>They will be deleted once they're processed.</p></li></ul></li><li><p><strong>Process Fleeting Notes and Create New Notes in the Permanent Notes Folder</strong></p><ul><li><p>Each new note should have a unique ID.</p></li><li><p>Notes can be <strong>atomic</strong> or <strong>hub</strong>:</p><ul><li><p><strong>Atomic</strong>: Keeps a single idea. Use your own words</p></li><li><p><strong>Hub</strong>: Aggregates other notes and draws conclusions. This is where new knowledge is created.</p></li></ul></li></ul></li><li><p><strong>Create Tags and Backlinks as Needed</strong></p><ul><li><p>At any point, create tags and backlinks to connect notes.</p></li></ul></li></ol><p><br /><br /></p>\n",
      "url": "https://oscarryz.com/zettlelkasten-method.html",
      "date_modified": "2025-04-08T20:33:31.279Z",
      "date_published": "2025-02-20T20:41:58.947Z"
    },
    {
      "id": "2acb3dc0-ec56-11ef-a612-516a02f65c36",
      "title": "Living is exciting",
      "content_html": "<h1>Living is exciting</h1><p>There are two things that I recently put together in my head, that are complementary:</p><ul><li><p>Routine creates discipline. When you get used to do things all the time they become easier and easier.</p></li><li><p>Breaking the routine is important. Always doing the same thing is boring, breaking it brings excitement.</p></li></ul><p>While these two seems so obvious I didn’t realize they go in hand, having a good base frees you to do creative thought, and breaking regularly from that base brings new ways to do things. <br /><br /><br /></p>\n",
      "url": "https://oscarryz.com/living-is-exciting.html",
      "date_modified": "2025-04-08T20:33:43.085Z",
      "date_published": "2025-02-16T11:07:10.108Z"
    },
    {
      "id": "accc52e0-e7c5-11ef-9250-07fb1cd42710",
      "title": "How to go back to sleep",
      "content_html": "<h1>How to go back to sleep</h1><p>Ok, I’m finally over the “go to sleep” phase in my life. <br /><br />Now I’m struggling with staying asleep. <br />The first part got solved by going to establishing a routine and sticking to it: going to be around the same time, stop using electronics moments earlier, no caffeine, etc.</p><p>Now, my problem is, if for any reason I wake up 4-5 hrs. after I feel asleep, my body feels it has rested enough and can’t go back. The only thing that has been working - some times - is to avoid moving at all, and tell myself: “I’m sleeping, I’m sleeping, I’m sleeping”. It works most of the times, but if I have to move or start thinking about something else, then I’ll feel more awake and won’t be able to go back to sleep. Sigh. <br /><br />Sometimes the movement is me trying to look at my watch for the time and see if I have had enough, sometimes it’s 4 am, which is good, sometimes is 10 pm which makes is easier to think I have to sleep more, but sometimes is 1:30 am, which puts me in 5.5 hrs of sleep, and then it becomes really hard to fall asleep again.</p><p>:/</p>\n",
      "url": "https://oscarryz.com/how-to-go-back-to-sleep.html",
      "date_modified": "2025-04-08T20:33:47.666Z",
      "date_published": "2025-02-10T15:42:46.542Z"
    },
    {
      "id": "f57bc890-dd7f-11ef-8be2-ef565a588032",
      "title": "My first conversation in a new language",
      "content_html": "<h1>My first conversation in a new language</h1><p>I’ve been learning Dutch on and off for about 2 years, and only until a few weeks ago, I’ve been consistently doing 5 minutes a day, which is not much.</p><p>Yesterday while playing Chess online I notice my opponent was from the Netherlands, so I said: <em>How gaat het? Dat is mijn een “phrase”</em> or <em>“How is it going? That is my one phrase”</em> And then I continued with small phrases with absolute broken Dutch like <em>”I learn Duch but know very small”</em>, and a few more along those lines.</p><p>I knew the phrases were wrong, the phone autocorrect got in the way more than once, and let’s remind, this was an online Chess game with time control! And yet, I manage to say a couple of things and be understood, got some replies, which I didn’t understood first and then were kindly translated to English.<br /><br />The game finished, I lose (barely) Then I realized, this was the very first time I communicate with another native speaker in their own language. I felt all those Duolingo harassments reminding me to keep my streak and all those <em>“This is a milk, that is a kid”</em> over and over again were worth it.</p>\n",
      "url": "https://oscarryz.com/my-first-conversation-in-a-new-language.html",
      "date_modified": "2025-04-08T20:34:00.594Z",
      "date_published": "2025-01-28T13:58:32.089Z"
    },
    {
      "id": "1f728b90-d9a0-11ef-a3e2-1d56991d6564",
      "title": "Can we scale up by scaling down?",
      "content_html": "<h1>Can we scale up by scaling down?</h1><p>I wanted to write something about how it seems we ruin everything we try to scale up. I deleted it a couple of times, but the main idea is the following:</p><p>We invented agriculture, but then we deplete resources needed to feed cities with million inhabitants. We invented democracy so we can be represented, but when we scale it up to the masses, it turns into marketing or popularity contests. We invented amazing forms of communication, but when millions argue, things become ugly really quick.</p><p>A humble but probably wrong “solution” is to return to the basics, renounce modern society, and go back to small villages, but that doesn’t really solve anything.</p><p>There must be a way to make things like small communities while keeping the benefits of modern civilization. A way to grow our food without depleting resources. A way to communicate without spreading anger and despair or talking in echo chambers. Probably we won’t find it right away, but if there’s something we have done as humanity through the beginning of history, it is to find new ways and keep trying.</p>\n",
      "url": "https://oscarryz.com/can-we-scale-up-by-scaling-down.html",
      "date_modified": "2025-04-08T20:34:26.426Z",
      "date_published": "2025-01-23T15:38:41.737Z"
    },
    {
      "id": "c5d9fdf0-d271-11ef-8738-ed11140cf144",
      "title": "On the importance of friction",
      "content_html": "<h1>On the importance of friction</h1><p><em>… or think twice before opening your mouth</em></p><h2>The early days</h2><p>I learned to avoid oversharing personal information as I grew up. If someone called (ha, the landline!) and asked, <em>\"Who is this?\"</em> I was told to never give my name but to ask: <em>\"Who do you want to talk to?</em>\" Then, it might be, <em>\"Uh... is this ___? This is Uncle Blah!\"</em> My instructions: hang up immediately if no such uncle existed, or be very careful if there was a coincidence.</p><p>Likewise, living in a big city, I learned to keep my wallet in my front pocket, not wear a watch or use a simple one, and later, when mobile phones arrived, not to use them in public. Geez! I even adopted the norm of sitting with my back against the wall and scanning the restaurant entry like they do in detective novels, to see who comes in and out. It was stressful.</p><h2>The new era</h2><p>Then the social web reached the masses (okay, now I feel like I'm really getting old). Mainly Facebook, not the many early social webs that came before as they less reach. It started private, with \"Share with friends and family only.\" Naturally, people shared photos of friends and family. I think you could also share publicly back then, just like having your own website. Well, even in 2025, having a personal website isn't frictionless, but it's not as hard as it used to be.</p><p>Back to Facebook, anything you posted was at least somewhat gated – you needed a Facebook account to see it. Then Twitter came along and made everything completely public for anyone. Then people probably not fully aware of the implications use it to overshare: family photos, birthdays, jobs, addresses, vacations, even their lunch!</p><p>The <a href=\"https://indieweb.org/corporate_web\">\"CorpoWeb\"</a> (ha, that's a great name ) had hijacked the human desire for dopamine and disguised it as another natural instinct: connection.</p><h2>So what now?</h2><p>My personal take is to treat everyone online as strangers (okay, maybe I'm overdoing it because I don't share much with close friends either, but that's another topic). You wouldn't share family photos with someone in a crowded plaza. In the best case scenario, they wouldn't care; in the worst, they could develop a malicious interest and care too much. And the worst part? You gain nothing. Sure, some people might make a living as content creators, but even they can tell you how awful it is to be a public figure constantly harassed.</p><p>Yet, the need for social connection and expressing yourself without being exploited for someone else's profit is real. I don't mind people making money. My company makes money, pay me and that's how I make a living. It's fair. What's not fair is unfairly capitalizing on someone's good intentions without proper compensation – making money off ads from something someone freely posted.</p><p>So yes, think twice before oversharing. Ask yourself, \"What am I gaining by sharing this? What could I lose?\" If there's no gain, then don't share.</p><h2>Oh yes, Software Friction</h2><p>As it can seen, limiting oversharing isn't just about IndieWeb vs. CorpoWeb. It applies to both online and real-life interactions. Maybe it's not so much about friction but more about privacy and common sense. Now, speaking of software friction, there should be none. No logins, setups, account creations, or even the need for your own website. Software should be frictionless, allowing you to freely achieve your goal – writing a blog post, a book, a spreadsheet – whatever you want to do, without fighting commands or configurations. The limitations or friction should come from your thoughts, not your software.</p><hr /><h5><em>This is an entry for </em><a href=\"https://vhbelvadi.com/indieweb-carnival-friction\"><em>January’s IndieWeb Carnival</em></a><em>. If you have blog consider writing an entry yourself.</em></h5>\n",
      "url": "https://oscarryz.com/on-the-importance-of-friction.html",
      "date_modified": "2025-04-08T20:34:33.268Z",
      "date_published": "2025-01-14T12:19:16.431Z"
    },
    {
      "id": "9ff0eeb0-d0e5-11ef-b78c-f7d262b79e5b",
      "title": "A quarter of century",
      "content_html": "<h1>A quarter of century</h1><p>When I was a child, the far distant future was the year 2000, remote, but certain. Thinking about 2005 or beyond was unimaginable.</p><p>I grew up thinking about the decades as the '20s, the '30s, the '70s—all belonging to 1900, of course.</p><p>There was so much hope about the future; obviously, science fiction was the most exciting topic. Would this future ever come? How could it be possible, for instance, to be able to have a conversation through my watch, or to know everything with a small handheld device, or to have self-driving cars? (Well, I don’t think anybody cared about self-driving cars, but we were definitely looking for flying cars.)</p><p>Then the year 2000 arrived. Things were slightly frustrating because the future didn’t deliver what was promised, and considering Windows 98 was the common state of computers (I probably should say “personal” computers, but that’s a bit implied), the “knowing everything” part was still far off. Yet, something nobody really asked for was taking off: the internet, the network of networks, and with it, the promise to have knowledge at reach instantaneously. Also, from the business point of view, the possibility to sell products with fine-grained targeting to the individual.</p><p>This was a real revolution, and then some of the promises of the future started being delivered. I remember how exciting it was to see Steve Jobs unveiling products like the iPod, then the new iPod, and then the iPhone, including the first video call. Google did tremendous work getting search results that were relevant and accurate. By the first decade of the new century, things felt like they were finally taking off. Today it seems we are gaining traction with personal robots and a little bit with the necessary distraction of large language models (LLMs, aka “AI”), quantum computers, and virtual reality, although the former is lagging behind.</p><p>All these exciting times leave us with a void in terms of dreaming about what the future would look like in, say, 2100, 2500—year 3000! The first obstacle is to keep humanity around that long and avoid self-destruction (the planet would survive for sure; I’m not so optimistic humans can live on it). Flying cars seem to be inconvenient unless they are fully self-driving. We still have telekinesis and teleportation as something to dream about. Ah, the end of poverty and inequality seems like another unachievable dream. Humans are always trying to be better than others, and the lack of poverty and world peace would mean new methods of attaining power and trying to be better than others would be needed. We can always resort to athletic competitions, and we can always be smarter, but something tells me this is not what a society without poverty would search for. Instant healing is another futuristic dream still very present.</p><p>2025—a quarter of a century! I have to scroll every year more to select my birth year in forms. Now it’s the '20s again, and we are halfway through. I never thought as a kid I would be living in this fabulous future. I hope I’m at this point halfway through my life, which means I will still have several decades to live. I wonder what that future will be like.</p>\n",
      "url": "https://oscarryz.com/a-quarter-of-century.html",
      "date_modified": "2025-04-08T20:34:41.546Z",
      "date_published": "2025-01-12T13:03:32.123Z"
    },
    {
      "id": "dd2a3ad0-b307-11ef-b052-9359870ba303",
      "title": "I like doing this",
      "content_html": "<h1>I like doing this</h1><p>I just listened to an opinion on how having a <em>“I like doing this”</em> mindset frees you from looking for ways to escape uncomfortable situations. The context is a chess game, a World Championship game to be precise. <br /><a href=\"https://en.wikipedia.org/wiki/Gukesh_Dommaraju\">Gukesh Dommaraju</a>, the challenger, was asked something along the lines of: <em>“Why do you have such a fighting spirit?”</em> His response: <em>“I just like playing chess.”</em> This allows him to endure what others might consider suffering. When you really realize you love playing chess, you want to play until the end; you don’t go looking for repetitions. Sometimes you make some risky decisions along the way, but with that mindset, you avoid feeling miserable looking for a draw. You avoid that miserable state of trying to get rid of the tension, avoid overworrying, and avoid overthinking.</p><p>I was wondering about this recently when facing a problem I was trying to solve, and nothing of what I tried worked. I honestly felt very discouraged after a few hours and just wanted to take a break and come back to it the next day. And sometimes that is what you have to do. But embracing this “This is a cool problem to solve” mindset allows you to keep pushing for a solution.</p><p>And if you can’t find it, at least you’re doing something you like.</p>\n",
      "url": "https://oscarryz.com/i-like-doing-this.html",
      "date_modified": "2025-04-08T20:34:49.390Z",
      "date_published": "2024-12-05T12:53:02.846Z"
    },
    {
      "id": "cfbd4cb0-9d32-11ef-9eba-7bf7e0a73afb",
      "title": "You have to practice to improve",
      "content_html": "<h1>You have to practice to improve</h1><p>Have you heard things like \"Just do it,\" \"Start small,\" and \"Divide into smaller tasks\"? Yet, sometimes you still don't find a way to get things done? I'd like to add an extra thing that I've noticed helps me: <strong>practice</strong>.</p><p>When you learn math, you're given an example, you understand the concept, but only after doing some exercises do you truly grasp it. The more problems you solve, the better you become.</p><p>Similarly, when learning new dance steps, the instructor (or video) demonstrates the moves, but it's only when you try them yourself that you start to get it.</p><p>The same is true for discipline, but unlike math or dance, it's not as easy to measure how good or bad you might be. For instance, no matter how many times you try to \"just do it\" to solve an advanced calculus problem, or how many times you try \"it's just a five minutes task\" to learn a professional choreography, it won't work if you’re not an advanced dancer.</p><p>Likewise, you can't just go to the gym or finish a project if you haven't mastered smaller habits. So, find a small, uncomfortable task to practice on. I use \"washing the dishes\" as an example all the time because I was terrible at it. Once that becomes easy, you can move on to something else and continue building your discipline muscle.</p><p>For the past year or more, I've been trying to write in my free time as a hobby, and often I procrastinate because it feels overwhelming. However, during this time, I've improved in many smaller tasks (like flossing my teeth or drinking water). Today, when I tried to write again, it was still difficult and overwhelming, but I managed to make some progress. Before, I would have just resorted to playing video games. I realized that my improved discipline in other areas helped me achieve this. These small wins remind me of the satisfaction of completing a task and create a positive cycle.</p><p>So, assess what you're trying to improve. Do you need to take a step back, or even two? Practice those smaller steps, master them, and then gradually incorporate more.</p><p>I hope this helps.</p>\n",
      "url": "https://oscarryz.com/you-have-to-practice-to-improve.html",
      "date_modified": "2025-04-08T20:35:01.604Z",
      "date_published": "2024-11-07T18:05:03.099Z"
    },
    {
      "id": "bcbb27c0-99bf-11ef-9de1-39bfae05cef3",
      "title": "Flawless Execution",
      "content_html": "<h1>Flawless Execution</h1><p>I recently came to the realization that I'm a perfectionist. I think that has an origin more related to self-criticism than an actual desire for flawless outcomes, which, unless you're doing something really simple, don't come by very often.</p><p>My first memory of thinking I was doing something wrong was in pre-K. I was probably 4 years old. I couldn't cut a piece of paper following a path. Let alone following a path, I couldn't cut it at all; the sheet just folded in my hands. Nobody told me then (or later) the reason I couldn't use scissors is that I'm left-handed. Years later, I found a better way to cut paper: folding it, sharpening a crest with my nails, and then just tearing it off. Almost a perfect result if you let go of the fact that there's a bit of loose soft paper right at the edge. That's fine.</p><p>Now I know that perfection, while enticing, is not as constructive as alright or even bad execution. Mistakes are learning opportunities, while flawless execution sometimes feels like a missed opportunity as there was no learning.</p>\n",
      "url": "https://oscarryz.com/flawless-execution.html",
      "date_modified": "2025-04-08T20:35:21.762Z",
      "date_published": "2024-11-03T08:43:45.596Z"
    },
    {
      "id": "db760550-8e1f-11ef-8f4d-ef1885e2f9c0",
      "title": "Two heads are better than one",
      "content_html": "<h1>Two heads are better than one</h1><p>This is an old idiom that likely everyone knows. What it doesn't explicitly state is <em>why</em>. It's not just that two people are thinking about how to solve a problem; they also communicate, exchange ideas, find flaws in each other's reasoning, and build upon each other's work.</p><p>This month, I've been working side-by-side with someone else. I wasn't just dividing the work to parallelize tasks, but we were actively working on the same problem simultaneously. This collaborative approach led to an immediate feedback loop of ideas. We were able to accomplish more in two weeks than we would have in a month.</p><p>It was also important to have time for ourselves. We worked on different schedules, which provided a much-needed break.</p><p>I believe this approach is superior to requesting help when we're stuck, although that still has its place. In this model, both people have the same information about the problem (there's no need to bring the other up to speed), and they have the same level of interest in solving it.</p><p>It might be daunting at first, especially for introverts. Maintaining good communication, active listening, and providing feedback can be challenging, so it's not something to do immediately.</p><p>I'll try to continue working this way from now on. It has made things more interesting.</p><p>By the way, in defense of remote work (or work from home), I think being in remote locations has made this easier. It's simpler to share screens than having someone else in your physical space trying to squint at your screen or having to tell them, \"Go away, I need to stretch.\"</p>\n",
      "url": "https://oscarryz.com/two-heads-are-better-than-one.html",
      "date_modified": "2025-04-08T20:35:30.735Z",
      "date_published": "2024-10-19T13:41:34.885Z"
    },
    {
      "id": "9405a480-6c61-11ef-86c3-151d5f12d3dc",
      "title": "Meditation and Diabetes",
      "content_html": "<h1><strong>Meditation and Diabetes</strong></h1><h2>Introduction</h2><p>Recently I've been learning a lot about how to Diabetes Type 2. I learned that lifestyle changes are needed to control it. The main ones are:</p><ul><li><p>Diet: Reduce the amount of carbs your body ingests.</p></li><li><p>Exercise: Help your body to burn those carbs.</p></li><li><p>Sleep: Let your body heal (and, you can't eat while sleeping :P ).</p></li><li><p>Stress: Avoid excess of adrenaline and cortisol which makes the insulin work harder.</p></li></ul><p>The first three were easy to understand, and of course, there's much depth for each of them. The fourth one; stress, was not very clear to me.</p><p>Stress is a tool our body has to get a boost of energy in certain moments, initially to run away from predators. In our modern life, our predators are different and some are artificial, but even then, stress can help us to focus on things that are important to us e.g. meeting a deadline, or protecting our loved ones.</p><p>Ok, so, when I tried to get more information on how to reduce stress I found (among many other things) meditation. But then I found meditation also in sleeping better, eating healthier, and memory, productivity, procrastination, anger management, and relationships, gee! basically, any other activity was somehow related to meditation, and I though this looked like a scam!</p><p>I have practiced meditation on and off for about five years, learning the basics, and getting better at it, and then I abandoned it for a few months. I felt a bit deceived because even if I got better at it (going from 1 minute, to 5, and up to 10) I never really felt it helped for all those things it offered. For some reason, the starting guides didn't explain clearly how it is going to help, or probably, I was not listening.</p><p>So, as I was saying 2 months ago I got my DT2 diagnosis. After the initial shock, I started learning about how to manage it, and eventually, meditation appeared again!</p><h2>How meditation works</h2><p>So first of all, a disclaimer, I'm far from an expert, there are many types of meditation, and the one I know is mindfulness meditation.</p><p>In mindfulness meditation, you make an effort to be present. What does that mean? You just focus on the current moment and don't think too much about what you did yesterday, nor what you have to do tomorrow.</p><p>The common misconception is you suppress thoughts and your mind goes blank, but that's not the case, is more about detecting when your mind starts wondering and catching it and bringing it back to the meditation.</p><p>You get better with practice. In the beginning, I was falling asleep all the time. The longer the practice the more I got distracted. Eventually, I was able to stay away and catch my mind before it wandered out of control.</p><h2>How it helps</h2><p>Suddenly it clicked, or I finally listened to what the guide was saying, and then I started finding more of it.</p><p>The whole point of \"catch your mind when it starts wondering\" is to be aware of what is happening, not only external noises or internal thoughts but also feelings. That was the mini woah moment. Yeah, I can meditate and avoid being distracted by the car passing by, or realize my mind was thinking about the things I want to do for the weekend, but it was not as easy to consider feelings when you're idle meditating (there are not many feelings happening at that moment), but as I got better (since diagnosis I've been trying to meditate every day) I realize (and I was told) I can catch my mind when I'm feeling something too.</p><p>Detecting the feelings is where meditation helps, for instance with procrastination: I have a pile of dishes to do. Before I just passed them and did something else, now when I'm passing in front of them I think: \"Ugh that's boring\", and then I could tell why I don't want to do them. Something similar happened with sleeping better; my mind was wandering and that was easy to spot, I should just stop thinking about the things I have to do tomorrow, but then I realized I could catch a feeling of why I was thinking about the next day! I was feeling anxious about waking up late and missing the bus. Now that I know the actual reason, I can think a little bit more about it and see if the worry is real or if I can do anything about it (\"like setting up the alarm\").</p><h2>Yeah, yeah, what does all this have to do with diabetes?</h2><p>So, how does this help with diabetes? Using this awareness to for instance improve my diet.</p><p>For example, I'm at a table, everybody is eating something high-carb delicious meal and I'm here with (also delicious) salad. Before I just grabbed a piece that high-carb food, and then another, and before I knew I was already chewing and probably extending my arm for more. Now I can detect this behavior before happens and do it consciously. I'm not saying that magically by meditating I just close my eyes and chant \"OOOOhhhmmmm\" and avoid cravings. I still grab a piece of that food. But now when I go for seconds I can detect and ask myself: Do I really want it? Most of the time the answer is: I don't. Sometimes I just want to feel included in what everybody is doing. This is what meditation helped me to detect. Before that, I was just acting without thinking.</p><p>The same goes for many other aspects, Anger: detect when I'm about to go nuts and consider. Productivity: Detect when I'm getting distracted and go back to what I have to do. Sleeping, avoid thinking about other stuff when I'm trying to sleep. And of course Stress: I can detect the source of stress, do something about it, and be in the driver's seat instead of just being a passenger, or I can tell if I can do anything about it at all. Anxiety: I can detect it now, I'm still working on how to deal with the source, but by being present I can break the worry cycle before it spirals out of control.</p><p>And the list goes on.</p><h2>Conclusion</h2><p>By being aware of what's happening outside and inside our mind, including our feelings, meditation helps to make better decisions.</p><p>Meditation is not easy, but is not hard either. It just takes practice like anything else, the more it is practiced, the easier it gets, or I guess it gets easier to realize there's nothing to do.</p><p>Of course, there are no magic pills. Just like diet would help us live better but won't cure us, meditation can help us take better control of our mind, but that's just another tool, a tool we can use to improve our quality of life.</p><h2>How-tos and resources</h2><p>There are a lot of resources on how to learn to meditate and apps.</p><p>What I use is now <strong>InsightTimer</strong>, which is just a tiny bell every 5 minutes.</p><p>I used HeadSpace and Calm to learn how to meditate, but now I prefer to skip the guides.</p><p>This Reddit post was super helpful to learn how meditation helps: <a href=\"https://www.reddit.com/r/getdisciplined/comments/ye0ikt/advice_how_meditation_helps_with_discipline_how/?share_id=J3ualuASyEw0GLg7YixHH&amp;utm_content=1&amp;utm_medium=android_app&amp;utm_name=androidcss&amp;utm_source=share&amp;utm_term=1\">[ADVICE] How Meditation Helps With Discipline &amp; How To Do It</a></p><p>There are studies that show that mind-body and emotion-based behavior help reduce A1c levels in people with Type 2 Diabetes:</p><p><a href=\"https://www.sciencedirect.com/science/article/abs/pii/S1751991822000602\">https://www.sciencedirect.com/science/article/abs/pii/S1751991822000602</a><br /><a href=\"https://www.liebertpub.com/doi/abs/10.1089/jicm.2022.0586\">https://www.liebertpub.com/doi/abs/10.1089/jicm.2022.0586</a></p><p>And finally it just looks cool to be sitting there looking like Yoda!</p>\n",
      "url": "https://oscarryz.com/meditation-and-diabetes.html",
      "date_modified": "2025-04-08T20:36:13.298Z",
      "date_published": "2024-09-06T15:06:22.280Z"
    },
    {
      "id": "285210a0-5fde-11ef-9d1f-f9318975e941",
      "title": "How Meditation Helps With Discipline ",
      "content_html": "<h1><strong>How Meditation Helps With Discipline &amp; How To Do It</strong></h1><p><em>Taken from a </em><a href=\"https://www.reddit.com/r/getdisciplined/comments/ye0ikt/advice_how_meditation_helps_with_discipline_how/?share_id=J3ualuASyEw0GLg7YixHH&amp;utm_content=1&amp;utm_medium=android_app&amp;utm_name=androidcss&amp;utm_source=share&amp;utm_term=1\"><em>r/getdisciplined</em></a><em> subreddit post written by </em><a href=\"https://www.reddit.com/user/kolter00/\"><em><strong>Kolter Veras</strong></em></a></p><hr /><p>I’ve been meditating on &amp; off for over 9 years, and just recently (over the past year) I started meditating VERY consistently. At first all I knew was that I kept hearing about meditation being good for anxiety and depression, so I looked into it a bit and started trying it. When I didn’t notice any results, I kinda put it on the backburner and only did it here &amp; there when I was feeling particularly stressed out.</p><p>It took a really long time for me to actually understand WHY meditation was important, the practical application/benefits of it, and how to actually do it. I want to share that with you today.</p><p><strong>1 - THE PRACTICAL BENEFITS</strong></p><p>The reason meditation is important is because it helps you with self-awareness and noticing the thoughts that come to you on a daily basis. If you can start noticing your thoughts and being aware of what’s going on in your brain, you can consciously decide if you agree/disagree with those thoughts, if you want to act on them, and if they’re even your own thoughts/opinions.</p><p><br /><br /></p><ul><li><p><strong>FOCUS AND QUALITY OF LIFE</strong></p></li></ul><p>If you’ve ever experienced reading something, watching something, or having a conversation with someone and then realizing that you have no idea wtf is being said and having to re-read/rewind/have that awkward moment where you ask what they were talking about, you should meditate. Meditation is the practice of noticing when your mind is elsewhere, and then bringing your attention back to whatever is happening in the present moment. After meditating consistently for a while, you’ll start to notice that its easier to read a whole paragraph or a whole page of a book without having to go back and re-read anything, or you’ll be able to have a conversation without getting sidetracked in your mind about what you have to do later or what you forgot to do earlier. The quality of your life goes way up, and the quality of the work you do/conversations you have also goes way up because you’re present and focused while you’re doing those things.</p><p><br /><br /></p><ul><li><p><strong>ANXIETY AND DEPRESSION GO WAY DOWN</strong></p></li></ul><p>Since I started meditating really regularly, my depression and anxiety have faded A TON. The reason for this is that anxiety and depression come from too much negative focus on the past or future. Anxiety is imagination in the wrong direction — anticipating something bad happening when it’s all in your head. Depression is dwelling too much on bad decisions you’ve made or bad experiences you’ve had, and in that case there’s nothing you can do about it except take action NOW so that you don’t make the same mistakes or have the same experiences going forward. Negatively dwelling on the past and making up worst case scenarios in the future is voluntary suffering, and meditation allows you to recognize when those thoughts are happening and cut them off. The longer you meditate, the quicker you’ll be to recognize and stop those thoughts, and the less you’ll feel anxious and depressed. Obviously there’s chemical imbalances, but if you DON’T have a chemical imbalance, this is probably where your anxiety and depression stem from.</p><p><br /><br /></p><ul><li><p><strong>CONTROL OVER YOUR DECISIONS</strong></p></li></ul><p>If you’ve ever told yourself “today I’m going to stick to my diet” and then somehow come to after eating a tub of Ben &amp; Jerry’s and wondered how you managed to mess that up AGAIN, you should meditate. Consistent meditation helps a lot with, again, recognizing the thoughts that you’re having and being able to consciously ponder and dissect them. You’ll be able to notice when you’re having those urges and actually be present enough to break the habit loop and stop yourself from indulging in something you know you’ll regret afterwards. This is the most important part of why meditation has been so helpful for me because since I’m able to control my urges and notice when they’re happening, I can stop myself from making decisions I’ll regret and dwell on later (depression) and since I KNOW I’m capable of staying present enough to make the right decisions, I worry a lot less about where my decisions are leading me (anxiety).</p><p>None of this happens quickly — meditation is a very slow process of very slow progress, but eventually you’ll start to notice that you feel more focused, present, and aware of what’s going on inside your mind. So how do we actually meditate?</p><p><strong>2 - HOW TO MEDITATE</strong></p><p>I’ve tried a lot of different types of meditation, and the one that works best for me now is just basic mindfulness meditation. I set the timer on my phone — 2 minutes, 5 minutes, 10 minutes, 20 minutes, whatever you feel comfortable with — and focus on my breath. I sit and pay attention to each in breath and out breath, and eventually (usually every 2-5 seconds) I’ll catch my brain thinking about something. Maybe laundry, maybe dishes, maybe something for work, maybe something I regret from yesterday, doesn’t really matter what it is, but I’ll catch myself thinking about it. The MOMENT you catch yourself thinking about something that isn’t your breath, just bring yourself back to your breath. It’ll probably be another 2-5 seconds before you catch yourself thinking about something else. Keep doing this over and over and over until the timer goes off. In real life, you’ll be reading or having a conversation, notice yourself thinking about something else, and be able to bring your attention back to the book/conversation. THAT’S WHAT YOU’RE PRACTICING.</p><p>You can also do guided meditations which are great at the beginning when you have a lot of trouble reminding yourself to bring your attention back to the moment, a couple great apps for guided meditation are Medito and Headspace. Headspace gives you a lot of meditations about certain things (anxiety, money, fear, etc) and Medito is really basic and just reminds you every 1-3 minutes to bring your attention back to the breath. I prefer Medito, but whatever works for you is fine.</p><p>I hope this post helps you out and I REALLY hope you give it a shot. This isn’t something where you can do it once or do it for a week and expect to notice results. Again, this is a very SLOW PROCESS of very SLOW PROGRESS, but when you do start to notice the benefits in your day to day life you’ll realize why everyone always tells you to meditate.</p><p>If this post did help you out, I’d really appreciate if you <a href=\"https://www.youtube.com/c/KolterMarchOnward\">checked out my YouTube channel</a> where I talk about discipline &amp; self-improvement and share what I’ve learned and what has worked for me. I appreciate you reading, good luck today.</p>\n",
      "url": "https://oscarryz.com/how-meditation-helps-with-discipline.html",
      "date_modified": "2025-04-08T20:36:16.269Z",
      "date_published": "2024-08-21T16:55:23.562Z"
    },
    {
      "id": "b2d63130-5b14-11ef-ad0c-8514f0687f77",
      "title": "It’s all on you",
      "content_html": "<h1>It’s all on you</h1><p>Yes, you're accountable for all the decisions you make (even being inactive is a decision), but the solution is not as simple as just use will power to solve all your problems, is not that simple.</p><p>You have to create a system, it is a long term process, an evolution if you want to.</p><p>It's ok to try different things, it's ok to ask for help. Oh you don't like the gym? Try going for a walk first. Are you anxious about an upcoming exam? Talk to someone, try different study methods. Can you redo the exam if you fail?</p><p>It's like running a marathon, you don't just start running and by simple will power complete the race, you need training, start by just walking, then move into longer distances.</p><p>Yes, it's all on you, but you don't have to do it alone. You initiate the process, you ask for help, you research different methods, you try different things, you create systems to keep things working.</p><p>Also you get the benefits.</p>\n",
      "url": "https://oscarryz.com/its-all-on-you.html",
      "date_modified": "2025-04-08T20:36:19.111Z",
      "date_published": "2024-08-15T14:43:12.963Z"
    },
    {
      "id": "47177800-4444-11ef-9e8e-891671697e9d",
      "title": "To overcome procrastination…",
      "content_html": "<h1>To overcome procrastination…</h1><p>Just go!</p><p>It’s simplistic and if life was as easy nobody would struggle, but after researching about the topic, all comes down to get over that discomfort, whether is to do the dishes, start homework, or do the lawn, those things won’t get done by themselves, and if you have to do them anyway, there are now two things to deal with, first the activity itself, and second now the discomfort of knowing you still have to it.<br /><br />You keep passing through the pile of dishes and they’re still there. Sometimes the consequences of inaction are clearly visible, sometimes they take a long time to materialize.</p><p><br />It turns out if you complete the task right away you can move on unto other things, the sooner you get through the discomfort, there’s less things to worry about, less task to do and by repeating it, it starts getting easier. <br /><br />Now not all the tasks are created equal, some are super complex and/or difficult to do, but are they really? Can you ask for help? Split the gigantic task into smaller ones, or just get started and see how far can you get?</p><p>At the end the fastest, more effective and at a degree easier way to overcome procrastination is to just go and do the thing.</p><p><br /><br /><br /></p>\n",
      "url": "https://oscarryz.com/to-overcome-procrastination.html",
      "date_modified": "2025-04-08T20:36:22.132Z",
      "date_published": "2024-07-17T13:55:51.296Z"
    },
    {
      "id": "21988230-e081-11ee-a322-7dd167f27775",
      "title": "Healthy conflict",
      "content_html": "<h1>Healthy conflict</h1><p>We're usually taught to avoid conflict, but sometimes conflict can be good when it's properly handled. For instance, at work, when there's disagreement and people are invested in their suggestions, it means they care. It's a bit controversial and shouldn't be confused with being stubborn. However, showing interest in something is a good sign.</p><p>Now, the way conflict can be beneficial is that all parties make an effort to understand each other. They don't have to agree, just listen to the other side. Ask questions about their motivations and explore what-if scenarios. Once all the information is at hand, the decision-maker (usually the person responsible for the task) can make a call.</p><p>It might not be easy for the party that didn't get their way, but it's important to commit and move on. This ends the conflict and, more importantly, allows for execution and the observation of results. The decision might not be perfect, but as long as it was made with all the information available, executing on it now will get you closer to the truth.</p>\n",
      "url": "https://oscarryz.com/healthy-conflict.html",
      "date_modified": "2025-04-08T20:36:24.964Z",
      "date_published": "2024-03-12T14:59:31.411Z"
    },
    {
      "id": "0fe1ff20-ccff-11ee-8fee-99ef4874a6b1",
      "title": "On Becoming US Citizen and the power of declarations",
      "content_html": "<h1>On Becoming US Citizen and the power of declarations</h1><p>I had mixed feelings about becoming US Citizen. This is something I’ve been working on for a long time; when my request was approved it felt a little bit awkward because I was still not quite there yet, and I didn’t feel like anything had changed, still an expat, still a guest. And that’s natural, my request was approved, but my status hand not changed yet.<br /><br />Today I participated in the Oath ceremony. Other 25 nationalities were represented there by the applicants, there were 51 of us, I didn’t know that and it felt significant; one per each US state.</p><p>The Judge gave us a speech that really moved me. On how the vast majority of Americans are born here because someone in the past took the step we were taking today, including his own family a couple of generations back. Making this country our home and the home of our family. He also mention about how for most of Americans, or those who immigrated as children, this has been their only home, but for some of us this is a change, and we might feel foreigners, or that we don’t belong, and that feeling, that phase stops today, after a long journey and several years we get to the final destination and we’re now no longer guests or aliens, we belong! just like the rest of the citizens here. <br />After that he declared us citizens. And we are in fact new Americans. That’s the power of declarations.</p>\n",
      "url": "https://oscarryz.com/on-becoming-us-citizen-and-the-power-of-declarations.html",
      "date_modified": "2025-04-08T20:36:28.282Z",
      "date_published": "2024-02-16T19:10:35.026Z"
    },
    {
      "id": "b0d1c9f0-beb9-11ee-977d-d5c9d8677ab2",
      "title": "Patience",
      "content_html": "<h1>Patience</h1><p>Paaaaatience….</p><p>It’s basically counterintuitive. One thing is for sure, the more I try it the better I get at it. <br />Probably is also something about the age. I wasn’t as patience, but also I had the idea that I didn’t have to. Obviously I was the first to suffer the consequences. <br />Nowadays I take a deep breath, or maybe five, and sometimes I still run out. Most of the times the best thing to do is to walk away from the source (probably a screaming child) and try again later. <br /><br />Being well fed and rested helps too, I guess it was the original trigger (being hungry) that make us go and kill something to eat. I’m so glad we’re over that era.</p>\n",
      "url": "https://oscarryz.com/patience.html",
      "date_modified": "2025-04-08T20:36:31.248Z",
      "date_published": "2024-01-29T15:18:43.983Z"
    },
    {
      "id": "9743d8d0-beb8-11ee-977d-d5c9d8677ab2",
      "title": "Getting sick",
      "content_html": "<h1>Getting sick</h1><p>After 3 year of pandemic and several months of not getting in contact with the world, I finally started going out again. And by going out I mean, go to the office to work, get into a store and get something, not really going out to have a drink.</p><p>Anyway, the inevitable happened, I got sick. I’ve got the flu and so did everyone in my household, fortunately not everyone at the same time. It was very mild for me, and yet, I have forgotten how uncomfortable it it to not being able to breath normally without coughing, or what is like to have a continuous running nose.</p><p>I’m very fortunate, it was just 3-4 days, plus the days before and after taking care of whomever was sick at the moment.</p><p>Wasn’t a great holiday season. I still tried to enjoy it, but it’s not the same celebrating New Year’s by going to bed at 7 pm with a headache and a red nose.</p><p>Still…</p><h2>Happy 2024!</h2>\n",
      "url": "https://oscarryz.com/getting-sick.html",
      "date_modified": "2025-04-08T20:36:34.447Z",
      "date_published": "2024-01-29T15:10:51.613Z"
    },
    {
      "id": "a0dc0830-91a5-11ee-b933-d563778b6ce3",
      "title": "Where did we go so wrong?",
      "content_html": "<h1>Where did we go so wrong?</h1><p>I’m trying to think where in the history of modern society and capitalism we got so wrong? We certainly live in the most prosperous era, there are many technological advances and life expectancy and health are better than any other era, and yet, living in a “modern” society is so hard. We spend our lives trying to save enough money to retire. We get debt to get an education that allow us to earn more money and then we spend a lot of time paying that debt.</p><p>It looks like simpler, mor connected way of living is possible and brings many benefits, better quality of life, longer life expectancy, less stress; but it feels to me as unattainable as the other end, the opulent ultra rich life. The simpler life, where ideally we self sustain and live in a small village, while nice, it seems to put us in the border of bankruptcy. <br />I was thinking this as I was reading about uncontacted human civilizations that don’t participate in this modern life. They don’t need money or any of the technological advances, in many cases it seems to bring the a better lifestyle. In our modern society, being good means a bigger house, more cars, buy more things, have more stuff, and then just pile them up, throw them away and buy more stuff. No wonder why in the United States the storage business is so successful and even exists, I wonder if is as big in other countries this business of have extra space to store things we own.</p><p>It is hard to grasp what’s the correct solution. I wish we were in a point where the machines do all for us so we can focus on having that small village community life, where we still can be farmers but just because we want to, because we like the smell of the dew in the morning. Or where we can go and paint in the plaza after talking with our friends and go to the market to pick up fresh vegetables.</p><p>We would probably never get there. It seems this always struggling, always making money for someone else is a model that is very well established and will go for much longer. I just hope we don’t destroy the resources we have to live in an attempt to have more stuff.</p><p>Anyway, I was just thinking about that.</p>\n",
      "url": "https://oscarryz.com/where-did-we-go-so-wrong.html",
      "date_modified": "2025-04-08T20:36:37.588Z",
      "date_published": "2023-12-03T06:31:44.947Z"
    },
    {
      "id": "0a36e1c0-83cc-11ee-b4c9-4fc0f3493eaa",
      "title": "Get busy",
      "content_html": "<h1>Get busy</h1><p>Sometimes I wish I had nothing to do and just rest or sleep, however, I had the opportunity in the past and is extremely boring. After a couple of hours you body gets tired to be in bed, watching TV (or videos) is entertaining just for a while and playing video games (or reading for that matter) is tiring after several hours.</p><p>It is good to be busy, to find hobbies, to be interested in other things, I guess the obvious thing here is balance. You need resting but too much rest is boring, you need to work, but too much work burns you out. You need hobbies but … hm if your hobby was your job and it was rested.. well I guess then you’ll get bored if you don’t balance it with something else.</p><p>My point, is, is important to get a routine, but is important that routine to be balanced and has different things and allow it to change from time to time. <br />Getting busy is entertaining and working towards something make life more interesting.</p><p><br /></p><p>I have to remember that.</p>\n",
      "url": "https://oscarryz.com/get-busy.html",
      "date_modified": "2023-11-15T16:26:51.012Z",
      "date_published": "2023-11-15T15:31:26.300Z"
    },
    {
      "id": "0c346e20-6e91-11ee-b199-f136936acdc1",
      "title": "Taking days off",
      "content_html": "<h1>Taking days off</h1><p>I’m so grateful to be able to take some time off to spend with the family.</p><p>It’s very important to be able to relax and stop thinking about the day to day and just enjoy the moment. Even if it’s only to play in the backyard bursting soap bubbles.</p><p>Autumn is finally here and I was able to spend time outside where the heat is no longer unbearable. Actually I liked the chill wind, but not to much to need gloves.</p><p>Anyway, having too much time off can be boring too, a week or two once in a while makes things so much better. I’m very fortunate to be able to do it.</p><p><br /><br /></p><p>Now let’s go back to work!</p>\n",
      "url": "https://oscarryz.com/taking-days-off.html",
      "date_modified": "2025-04-08T20:36:43.460Z",
      "date_published": "2023-10-19T15:06:14.914Z"
    },
    {
      "id": "1017eb90-5ec7-11ee-8959-57a6ef44c2c6",
      "title": "Quick wins",
      "content_html": "<h1>Quick wins</h1><p>This week the task I’m working on started to feel like is not making progress. I’m doing some research and so far is good, I’m raising questions which gives me a good idea of what I have to work on, but these questions doesn’t feel like progress.</p><p>I decided to switch a little bit to do some other task that I know will be easier and faster to complete. This gave me a sense of progress and fortunately it will help to answer some of those questions, so after all is still helping.</p><p>This is a good way to keep the momentum going. Unfortunately is not always possible to have an additional simple task to work on, or sometimes the new task will take much longer and will just distract from the original task and will turn into procrastination. In either case I think it’s important for me to recognize that it’s ok to work on something else even if I’m not working on the main task, it is still work after all.</p>\n",
      "url": "https://oscarryz.com/quick-wins.html",
      "date_modified": "2025-04-08T20:36:46.581Z",
      "date_published": "2023-09-29T12:52:35.658Z"
    },
    {
      "id": "d71716d0-50a3-11ee-9356-6792d0b374ab",
      "title": "Progress",
      "content_html": "<h1>Progress</h1><p>This is not an early celebratory post, because the progress I’ve made is not an end goal, thus is basically impossible to fail (or to mark as “complete”) Instead is a moment to reflect that in the last 6 months ( probably a year or maybe a little more ) I have finally made some small improvements in my lifestyle.</p><p>I used to go to sleep at 11 pm when I was very young, then it turned into 12 am, 1 am, which, was ok; I still slept around 8 hrs and just needed to started my day a bit later. But in the last years that turned into 2 am, 3 am, 4 am! That’s not good mainly because I still had to go to work and even getting there at 11 am it was as little as 6 hrs of sleep (which now it sounds actually good) but I definitely couldn’t just start working at 11 without stopping to work at 8 pm which kept the cycle going (get home at 9pm, watch tv, have dinner etc.). Still I didn’t feel this was terrible because that was my routine. Of course sleeping at 2-3 am added an extra meal around midnight and mainly the only thing available was fast food (I remember going to the movies for the 12 am show, to have dinner, or checking when was the last time a pizza could be delivered). Anyway, slowly this bad nutrition, poor sleeping turned into low energy, and I started to feel depressed.</p><p>As usual, change happens, not because of a strong will, but rather because small thing changed, in my the thing that changed was that I have to start working at 7 am. Well, sleeping at 4 am and start at 7 am is not a good start, and while I did it several times, things got worse. So what do you do? You have to go to bed earlier, like way earlier. It is hard, I was there laying in bed without wanting to sleep. It took a couple of no-sleep at all days, to be extremely tired to be able to fall asleep at 9-10 pm, which helped, but still didn’t solve the problem like magic, other habits needed to change too.</p><p>So what could I do when I needed to change so many things at once? Sleep early, wake up early, stop using the phone ( so I can fall asleep ), eat healthy, stop midnight cravings, start exercising while at that, save money I guess because why not if I have to do all these things? It was too much. So, what I did was just start one thing at a time (this sound so painfully obvious now, but I tried to do all at once, more than once, actually for years, as a matter of fact, today I still want to do 2-3 things at a time). <a href=\"https://oscarryz.com/a-routine-that-works.html\">Every Sunday I write in a board what I want to do the starting week.</a> Just one thing. for example, “Get up at 6 am”, and then that week I tried and keep trying. If I failed on Tuesday (Monday was usually always done) I try again on Wednesday. If at the end of the week the thing didn’t happen I could try the next week or abandon the attempt and try something else instead; but just one thing. One improvement at a time for a whole week.</p><p>Eventually I was able to wake up at 6 am. Next thing, go to be before 10 pm, and then before 9 pm. Nah didn’t work. Oh it’s because I’m watching videos at 8 pm? Ok, stop watching videos. No progress? What about put the phone in night mode and then watch videos without color, without sound. Eventually I stopped watching videos and then I was able to sleep early and then I was able to wake up early and because I was sleeping I was not eating junk food at midnight etc. a positive cycle started.</p><p><br /><br /></p><p>This week is my second week running early in the morning (just 2 miles) , at, wait for it…. at 5 am! Why 5 am? (Ok, 5 am is the aim, but I start around 5:30ish) Because if I want to eat breakfast before 7, I have to make breakfast by 6:30, so I have to finish doing whatever I do before that by 6, because there are gaps here and there and those little gaps take 10, 20 minutes each time. So if I wanted to run, I needed to get up earlier. And because I didn’t want to just “rush” (I hate when I feel I’m in a rush) I kept pushing the starting time to 5 ish.</p><p>Today, while I was thinking while making breakfast at 6:40 am, how far I’ve gone following this approach. There are many other things I want to try and start doing, and I know I eventually will do them, there’s no rush. I’ve been trying for decades to get healthier habits so I’m sure the next thing I’m going to improve can wait for another (several) week(s), but when I get there it will stick.</p>\n",
      "url": "https://oscarryz.com/progress.html",
      "date_modified": "2023-09-12T17:24:17.712Z"
    },
    {
      "id": "07cf65c0-4bf4-11ee-ae75-dfe2cf7f2033",
      "title": "It’s ok to go slow",
      "content_html": "<h1>It’s ok to go slow</h1><p>I mean, what’s the benefit of rushing unless you have a clear idea of what you’re doing and know exactly were are you going (just like in a race, where you have practiced and know exactly the track and now you’re just trying to do it faster), but if you don’t really know and are discovering the path, take your time, learn along the way, and keep moving. There’s an old saying from where I’m from: “Slowly that I’m in a hurry”.</p><p>Or in Daniel Tiger terms:</p><blockquote><p><em>”Do your best, your best is the best for you.”</em></p></blockquote>\n",
      "url": "https://oscarryz.com/its-ok-to-go-slow.html",
      "date_modified": "2023-09-08T14:32:13.958Z"
    },
    {
      "id": "15320220-4034-11ee-aafc-195b044a1cce",
      "title": "Ask yourself, what’s the benefit?",
      "content_html": "<h1>Ask yourself, what’s the benefit?</h1><p>Sometimes I have to do something, but I don’t really want to; it’s a tedious tasks, or unpleasant or simply boring. </p><p>The best thing I can come up with to make me do it (or not do it) is to ask what’s the benefit of that task?  Is there one? It it clear? Maybe there’s no benefit at all and I can just not do it and do something else instead. Maybe the benefit is not clear and just looks like another imposed task (self imposed or not) and that’s just something to avoid, but many time, if not always, there’s a direct benefit from doing it (or a cost for not doing it). Being conscious of what the benefit is, might help to get it done. And if there’s no benefit, simply don’t do it. To to whom asked you to do it and try to see if there’s something else you can do instead. </p><p> </p>\n",
      "date_published": "2023-08-21T15:04:53.314Z",
      "url": "https://oscarryz.com/ask-yourself-whats-the-benefit.html",
      "date_modified": "2023-08-21T15:04:53.315Z"
    },
    {
      "id": "1af89c70-3786-11ee-bd73-710b096f83b8",
      "title": "Fighting discomfort",
      "content_html": "<h1>Fighting discomfort</h1><p>Well, fighting isn’t the right word; tolerating? enduring? ignoring? pushing through?</p><p>Sometimes there are things around us (or inside us) that we find annoying and we can’t stop thinking about them and we can’t focus on whatever we have to do at that moment. Sometimes we can fix the annoying thing (e.g. a small stone in your shoe), and some other times we can avoid it (e.g. go to another room to read when the one were you were is too loud). But what happens when the thing that annoys us is out of our control? ( e.g. a folded strap on someone’s backpack … on a tv show?) Or even worse, the thing that annoy us is the very thing we have to do in that moment?  (e.g. doing the dishes)  We have to learn how to push through the discomfort it causes, otherwise we would go into a halt and the discomfort would just last longer.<br /><br />Often times this “push through” will help to manage better those annoying but necessary things we have to do. Eventually they’ll become easier and we’ll be ready to handle other more annoying or difficult task better, but we have to try, otherwise we’ll stay forever in level 1.  </p><p><br /></p>\n",
      "date_published": "2023-08-10T13:59:21.271Z",
      "url": "https://oscarryz.com/fighting-discomfort.html",
      "date_modified": "2023-08-10T13:59:21.271Z"
    },
    {
      "id": "5c408760-306f-11ee-b615-ffde281cc1e8",
      "title": "RTO",
      "content_html": "<h1>RTO</h1><p>Today after 3 1/2 years of WFH I’m going back to the office. I’ll go in hybrid mode, 3 days at the office, 2 days WFH, which I assume eventually will go away.</p><p>There are a lot of good thing about working remotely, mainly chat is the preferred way of communication . If face to face communication is needed, a quick video conference can be arranged in seconds with additional advantage we could share screen and see what the other was talking without having to be on their shoulder.</p><p>Of course the convenience to be back at home by simply closing the laptop, and get to use all the house rooms. I literally didn’t spend time in the living room before the pandemic, it was just a room to get to the kitchen. Now I use it all the time.</p><p>Not to mention how easy is to get hug from/to your loved ones at any moment, I don’t think my co-workers will want to pertake. </p><p>I’m going to miss it (at least 3 out of 5 days a week).</p>\n",
      "url": "https://oscarryz.com/rto.html",
      "date_modified": "2023-08-01T13:37:14.131Z"
    },
    {
      "id": "a8267010-24a1-11ee-90a5-956eca3f78ab",
      "title": "Walk, and talk and eat.",
      "content_html": "<h1>Walk, and talk and eat.</h1><p>The day is new<br />The sun is coming up.</p><p> There are trees on one side, there’s the city in the other.</p><p>The lake / river is so calm it creates almost a perfect mirror of the trees, the city and the sky.</p><p>Only disturbed by the paddling, and the birds waking up, and the honking of the cars of the city that’s also waking up. </p><p>And we’re talking. </p><p>And I haven’t been this happy in a long time,</p><p> not like this,</p><p>not this long,</p><p>not with you. </p><p><br /></p><p>My arms are getting tired of so much rowing, the sun is threatening to come up full force and burn us.</p><p>The gentle clouds that help us extend this moment can’t hold it anymore. We have to go back.</p><p><br /></p><p>But what if…</p><p>     … we go into that city</p><p>                   … and we walk, and talk (and eat) a little bit more?</p>\n",
      "url": "https://oscarryz.com/walk-and-talk-and-eat.html",
      "date_modified": "2023-07-17T13:06:05.962Z"
    },
    {
      "id": "1dc9c0f0-1fe4-11ee-b4da-9faa63075586",
      "title": "Perfectionism, Procrastination, Stress, and taking deep breaths",
      "content_html": "<h1>Perfectionism, Procrastination, Stress, and taking deep breaths</h1><p>You might be a perfectionist and think people would judge you for your work, so much so you don't even want to start it because you know it won't be perfect.</p><p>Try to embrace imperfection. Start doing the task at hand for 5 minutes and feel the discomfort (the pressure in the chest, the heat, the sweating, the lack of air), that's your body saying <em>\"This is bad I don't want to do it\"</em> because you think the outcome won't be perfect; when that happens, take a deep breath, tell your self <em>\"This is ok, I'm not in danger\"</em> (that chest pressure is you body reaction to danger) and count to four, then if you can, try keep working for another 5 minutes and repeat. Eventually you'll teach your body that that's ok, you're not in danger, you don't need to do a perfect job, a good job is enough and people won't judge you for it. Even if you do a bad job that's ok too, <a href=\"https://oscarryz.com/how-to-make-mistakes.html\">mistakes are can be used for learning</a>.</p><p>Stress is a natural reaction to danger, for a time when we used to live in the wild and be chased by predators. Modern life doesn't have predators but our body doesn't know that and still generates stress for other reasons, like having to do desk work. In the wild stress would get you the energy needed to run away from the predators and this would release the stress, but in modern life there's no predators and that stress intoxicates you. Your body reaction is to avoid that source of stress. You might not even want to get out of bed because, what are you going to do next? brush your teeth, and then what?, oh no, you have to work -&gt; stress!!!. By the way not all stress is bad, but that's a <a href=\"https://oscarryz.com/mindsets.html\">different topic</a>.</p><p>Some exercise and sunlight helps release the stress too. Mental therapy helps to understand these things as well and gives you more tools, but you need more than one session.</p><p>Good luck. I know it's hard. It won't be easy, but it won't be as hard as you think.</p><p><em>Original: </em><a href=\"https://www.reddit.com/r/getdisciplined/comments/14wbqzu/comment/jrilop7/?utm_source=share&amp;utm_medium=web2x&amp;context=3\"><em>myself here</em></a><em>.</em></p>\n",
      "url": "https://oscarryz.com/perfectionism-procrastination-stress-and-taking-deep-breaths.html",
      "date_modified": "2023-07-11T17:47:40.875Z"
    },
    {
      "id": "4dacfa70-0abe-11ee-a1a8-13cf87bca0a6",
      "title": "Why forming a new habit is so hard?",
      "content_html": "<h1>Why forming a new habit is so hard?</h1><p>I’m not answering the question, just formulating it.</p><ul><li><p>Probably because I’m trying too many changes at once?</p></li></ul><ul><li><p> Probably because I haven’t been able to get rid of some other habit incompatible with the new (e.g. try to wake up early when I still stay up until late at night). </p></li><li><p>Probably the benefits are not completely internalized. </p></li></ul><p>Regardless of the reason, I think is important to be patience and try just a little at a time. If it fails, it’s ok, I can try again. That’s something I was not used to, I used to take failure as something to avoid at all cost (see  <a href=\"https://oscarryz.com/mindsets.html\">mindsets</a>), but I’ve been learning  when you fail (or when something is hard to do) that’s when you grow. There’s no growing on keep doing something that’s easy. </p><p>So I guess I just have to keep trying. So far is have been very good.</p>\n",
      "url": "https://oscarryz.com/why-forming-a-new-habit-is-so-hard.html",
      "date_modified": "2023-06-14T14:20:35.880Z"
    },
    {
      "id": "87812390-053f-11ee-9fdb-75ee7d54a249",
      "title": "How to get to sleep (again)",
      "content_html": "<h1>How to get to sleep (again)</h1><h2>What didn’t work</h2><p>Well it turns out <a href=\"https://oscarryz.com/how-to-get-to-sleep.html\">my previous technique</a> to get to sleep stopped working usually for one of these reasons:</p><ul><li><p>Sometimes the fond memory is too interesting and I just keep thinking about it and my mind starts wondering instead of falling sleep.</p></li><li><p>I’ve had too much screen time and/or just played a video game and the adrenaline rush is still there.</p></li><li><p>Too much caffeine after 4 pm</p></li><li><p>Too much light from electronics in the room; keyboard with backlight, wi-fi endpoint, electric plug on/off indicator, computer charging etc. </p></li></ul><p>So I’ve changed the technique to avoid these things. I’m not going to lie it’s hard to get out of the phone, and realistically I will stop trying, so what I do instead is use the “Bedtime mode” + “Night Light” the phone provides to reduce the amount of light my eyes receive. I do stop playing games and just browse things instead, I try to finish my coffee by 4 pm. I unplug or turn off electronics and recently I’m trying using a face mask to increase darkness.</p><h2>Visualize darkness</h2><p>In addition to that the most impactful thing I’ve done is to “visualize” what my eyes see when I close them. I don’t know if this happens to everybody but when I close my eyes, I don’t actually see “black” but like a red/black cloud moving very slowly. I assume is the blood flowing through my eye lids veins or something, is very subtle. When there’s more light the cloud is blue or yellow. Anyway now instead of having a fond memory I try to see this dark cloud and see where it moves. I guess is a form of meditation because I don’t think of anything else. Eventually I fall asleep. </p><h2>Summary</h2><ul><li><p>Reduce screen time before bed and/or use soft light.</p></li><li><p>Don’t get into adrenaline rushes before bed.</p></li><li><p>Visualize darkness.</p></li></ul>\n",
      "url": "https://oscarryz.com/how-to-get-to-sleep-again.html",
      "date_modified": "2023-06-07T14:29:26.016Z"
    },
    {
      "id": "8628a4d0-f65f-11ed-86a2-5ff6008f6132",
      "title": "Stop! Just ask for help!",
      "content_html": "<h1>Stop! Just ask for help!</h1><p>I often times delay asking for help because I want to try to resolve the problem myself, which is great, that's I think is the right thing to do; give it a try, gather information, make notes on what have you tried before so when you ask for help you can let who is helping you what have you tried and the problems you faced so far. </p><p>What I've been improving lately is how soon should I ask for help. Sometimes I think I'm close to find the solution so I delay the call, sometimes I haven't tried all the steps in a guide I'm following so I delay the request. Sometimes there's a meeting in the next 10 minutes so I postpone the request for help because I'm going to be interrupted anyway. And sometimes too much time goes by and I'm still stuck. Which leads me to feel uncomfortable to ask for help then because I should've asked before, which then leads to a bad cycle. When I notice that I think to my self: *\"Stop! Just ask for help!\"*</p><h2>What if's</h2><p>What if nobody can help me? What if they don't know either? What if nobody wants to help me? What if it shows I have no clue what I'm doing? Another reason why I postponed asking for help was all these what if's. From them all the only valid one is \"What if they ask me what have I tried before\" which I agree, I have to try something before. But for the rest the end result might be that I still have the problem (e.g. if nobody knows how to solve) which is basically the same spot where I am, so there's no loss in asking. The sooner I ask (after trying) the faster I'll know if there's something missing. </p><h2>Preparing for asking might solve the problem</h2><p>Often times, when I get ready to ask for help I have to explain what is the problem clearly. For instance if asking in a written form (forum, chat, slack channel, email) when I have to describe clearly and succinctly the problem, what I have tried and what's the problem I'm facing. More than once going through this process I have realized I missed one step, and then I don't need to ask anymore.  When I ask verbally there's a similar process while I'm explaining I realize or the helper realize a step is missing and the problem is solved. Even trying out-loud with an unanimated object such as a <a href=\"https://en.wikipedia.org/wiki/Rubber_duck_debugging\">Rubber Duck</a> can help. </p><p>Some problems might take days, to solve and I might not remember all the details, writing a document with dates and tries helps remember all these details, and this document can be shared with others when asking for help.</p><h2>When the problem is solved write it down</h2><p>I might not have the same problem again, but that's not guaranteed, furthermore, I might have exactly the same problem six months for now and I might not remember all the details. Things might have changed, new variants appeared, guides get outdated. There might not be guides in the first place. So it's good to write down what the solution was because that can help me in the future, and potentially help others.</p><p>The sooner I get into this process the sooner I stop going in circles by myself and the faster the problem might get solved. So I have to remember to just ask for help.</p>\n",
      "date_published": "2023-05-19T16:09:25.149Z",
      "url": "https://oscarryz.com/stop-just-ask-for-help.html",
      "date_modified": "2023-05-19T16:09:25.150Z"
    },
    {
      "id": "56b0cb50-e288-11ed-85b2-0969bf5305d1",
      "title": "A routine that works",
      "content_html": "<h1>A routine that works</h1><p>After trying several productivity methods, I finally found/adapted one that actually works. The key is to keep it lose so that it’s easy to restart in case of failure.</p><p>First, buy a weekly planner like <a href=\"https://www.amazon.com/dp/B07HF9WPMF\">this one</a>. Every Sunday night, before going to bed, write down what you want to achieve, what new habit you want to form, or what new goal you have in mind. You might have dozens of projects, but just pick one – any one.</p><p>During the week, try to keep the habit going. If you fail one day, that's okay; you still have six other days to catch up. If you fail the whole week, you can restart the following Monday.</p><p>Evaluate how you feel about your new habit every Sunday. If it seems too hard, just move on and try something else. If you think you need a couple more weeks to make it stick, keep at it. I usually want to try new things every week, but the previous habit sticks.</p><p>This method worked for me because I'm a perfectionist, which is not always a good thing. Sometimes, I put things off because I want to over-plan them so that they're perfect. With the weekly planner, I just GO and do them. After all, if they're not perfect, I can refine them the following week.</p><p>Also, sometimes it's discouraging to lose your streak (if you're trying to keep monthly or yearly goals). \"Yeah, I did that for six months, and then I had to travel and lost my streak! I'm not going to do it anymore.\" With this method, I have two opportunities to restart: one every day and another every week. If something isn't working after a couple of weeks (like getting up at 5 a.m. and running six miles), I just remove it and try the next thing.</p>\n",
      "url": "https://oscarryz.com/a-routine-that-works.html",
      "date_modified": "2023-04-24T10:16:39.194Z"
    },
    {
      "id": "7803fff0-31f5-11ed-bb54-936e00f4e66a",
      "title": "Mindsets",
      "content_html": "<h1>Mindsets</h1><h5>Sept 2022</h5><p>I came across <a href=\"https://hiddenbrain.org/podcast/reframing-your-reality-part-1/\">this episode</a> of The Hidden Brain podcast, where they talked about how the mindset we use to approach life affects our perception of reality. That is something I've heard before but was more in the realm of prep-talk or motivational speech than an actual tool, \"think big\", \"cheer up\", \"if you put your mind into something...\" etc., etc. I couldn't stop thinking that it was closer to denial than actually solving problems. Saying: \"I just have to try harder, and this problem will be gone.\" </p><p>I've learned we approach problem-solving with more than just the details of the problem, but with a specific mindset that helps us think about solutions or not. When we see stress as debilitating, something to avoid at all costs, then in stressful times, we feel bad about it, in addition to the stressor itself. Some people see stress as an opportunity to shine, a moment to put their training into practice, or a learning experience. The problem remains the same, but our minds help us to see different solutions depending on the mindset. Furthermore, even if we don't have a problem to solve, our body reacts as well; that's why the placebo effect even exists because sometimes thinking of getting better gets you better. Even exercise that should be as objective as it could (you do the pushup or don't), is affected by the mindset. Of course, is important to avoid falling into a <a href=\"https://en.wikipedia.org/wiki/Toxic_positivity\">Toxic Positivity</a> state where everything can be magically solved, there are things beyond our control and we shouldn't disregard them.</p><p>What is almost life-changing for me is to learn not all stress is bad, sometimes things stress us because we care about them and that stress could help us to get things in motion. Also, something that I already knew, is how we perceive ourselves defines how we act, and now these studies close a gap I had between \"faith\" or \"wishful thinking\" and \"hard science\", because now the science shows \"faith\" has an actual effect. </p><p>I've been trying to put this knowledge in practice every time I face a new challenge (as little as it might be), by thinking: Is this something I can learn from or something I'm prepared for? Or is this something I should avoid? Most of the time is the former, and most of the time that helps me to just do it. Just like this <a href=\"https://twitter.com/DukeWBB/status/1544291475608899584\">coach says here</a>, is not that things get easier with time, is that you get better at handling hard. Then you're ready for the next level and the next level. This is exactly how we learn to do things as babies, I can't remember but I bet it was really hard to learn to walk, talk, read, or throw a ball.</p><p>Level up!</p>\n",
      "url": "https://oscarryz.com/mindsets.html",
      "date_modified": "2022-09-11T17:20:44.210Z"
    },
    {
      "id": "1275f0b0-fef3-11ec-be0b-439f529702f8",
      "title": "How to make mistakes",
      "content_html": "<h1>How to make mistakes</h1><p>Mistakes are a great learning tool. By not being afraid of them we enable ourselves to reach new things.</p><p>Here is a brief reflection on how to make them.</p><ul><li><p>Step #1 Don't be afraid of making mistakes.</p></li><li><p>Step #2 If you make them, try not to repeat them.</p></li><li><p>Step #3 If you think something could lead to a mistake, consult with the team (give them a heads up), it will be a team mistake with more people to help solve it if it happens.</p></li><li><p>Step #4 Learn from the mistake.</p></li><li><p>Step #5 Repeat.</p></li></ul><p>The point is the socialization, we work on teams and we do better when we support each other. </p><p>Also relevant is to differentiate between mistake, error, and accident; there's a great deal of overlap, but for the most part they can be differentiated.</p><blockquote><p><em>mistake: to blunder on the choice of</em></p><p><em>error: an act or condition of ignorant or imprudent deviation from a code of behavior</em></p><p><em>accident: an unforeseen and unplanned event or circumstance</em></p></blockquote>\n",
      "date_published": "2022-07-08T19:20:48.188Z",
      "url": "https://oscarryz.com/how-to-make-mistakes.html",
      "date_modified": "2022-07-08T19:20:48.190Z"
    },
    {
      "id": "c9c0bb10-cb31-11ec-84a1-bf1334f56ba3",
      "title": "Today I Learn Documents",
      "content_html": "<h1>Today I Learn Documents</h1><p>My team at work has been using these “Today I Learned” documents for a while now. This is an explanation of what they are and why are they useful. </p><p>Also this is <strong>very diluted</strong> and extra simplified approach inspired by Zettelkasten method.</p><h2>Why?</h2><blockquote><p><em>“If you learn something, write something.”</em></p><p>(probably me)</p></blockquote><p>Think about the time you asked something or the last time you had a rubber ducking session; when you ask, you order your ideas to present them to someone else, and often in the process you find the answer. </p><p>Similarly, when we learn something and we write it down, we confirm our learnings, and that creates a link in our memory (that's how memory works) and we create a new piece of knowledge in our brain with the extra benefit we can consult it later.</p><p>Other benefits</p><ul><li><p>Makes it easier to share with others. </p></li><li><p>Unloads it from your short-term memory.</p></li><li><p>Very likely you'll use it yourself again.</p></li></ul><h2>How?</h2><h3>Name it how you'd use it</h3><p>Create a document and put as the title the learning. It is very important to name it as how you would like to search for it, instead of what the actual content (so you can Ctrl + F easily) </p><p>Example: Let’s say the learning was how to use duration literals (1h, 2m) in configuration files after reading <a href=\"https://docs.spring.io/spring-boot/docs/2.1.9.RELEASE/reference/html/boot-features-external-config.html#boot-features-external-config-conversion\">this documentation</a>.</p><p>An ideal title would be:</p><p><em>“Use Simple Duration literals in application.yml file”</em></p><p>Instead of: <em>\"External configuration / Properties conversion\", </em> because the next time you need it you’ll search something about duration or literals, and not necessarily about properties conversion.</p><h3>Keep it very short</h3><p>This is not a substitute for \"formal\" documentation. Use screenshots if possible and describe the happy path. The intention is to trigger the knowledge you already have, not necessarily to be a comprehensive guide to something. Write a formal document for that. </p><p>Don't worry about re-document the obvious. It might not be obvious to others.</p><h3>Use your own words</h3><p>Perhaps the most important part of this document is to use your own words, even if they are not perfect. You'll see when you're trying to word it properly if you need to double-check your facts. Also using your own words creates a deeper link.</p><h3>Add references!</h3><p>Remember the last time you did exhaustive research? You end up with dozens of open tabs. Then you solve your problem and close all of those tabs (or bookmarked them)? Well, save them! Write your learning and add a \"Resources/References\" section at the bottom. </p><h2>When?</h2><p>Every time you learn something. </p><p>If you're going to explain something to someone, they might as well create a TIL with the learning. </p><p>The next person can use it as a reference and is very likely that person will be you.</p><h2>Finally</h2><p>Create an index where that can easily be accessible to any team member, it could be a blog or an index in another document. </p><p>Share it with the right audience.</p><p>Keep it low friction! We might be tempted to use complex classification but the easier they are to write the better.</p><h2>TLDR</h2><ul><li><p>Name it as you’ll want to find them</p></li><li><p>Keep them very short and add references at the bottom</p></li><li><p>Use your own words</p></li></ul><h2>References</h2><p><a>Zettelkasten Note-Taking Method: Simply</a>  (YouTube video)</p><p><br /></p>\n",
      "date_published": "2022-05-03T22:38:44.033Z",
      "url": "https://oscarryz.com/today-i-learn-documents.html",
      "date_modified": "2022-05-03T22:38:44.034Z"
    },
    {
      "id": "66c0ec80-bc39-11ec-80f3-954b512adf78",
      "title": "The power of feedback",
      "content_html": "<h1>The power of feedback</h1><p>It’s very hard to know what are we doing good or what are we doing right objectively.</p><p>That’s why is important to request feedback and keep an open mind and practice <a href=\"https://www.google.com/search?hl=en&amp;q=active%20listening\">active listening</a> so we can understand and process that feedback.</p><p>When giving and receiving feedback is important to know the communication style of the interlocutor and try to adapt to it. The most important part regardless is to keep it objective and separate the facts from the person, we are not prising or criticizing the person but the actions based on their merits.</p><p>It takes practice to give and receive feedback but the benefits are huge, we can now action of things we didn’t know, or we didn’t know in their entirely.</p>\n",
      "url": "https://oscarryz.com/the-power-of-feedback.html",
      "date_modified": "2022-04-14T21:27:25.260Z"
    },
    {
      "id": "d2b08240-b845-11ec-b732-a5360b70def9",
      "title": "My favorite analogy for writing code is writing a book",
      "content_html": "<h1>My favorite analogy for writing code is writing a book</h1><p>When I want to explain the challenges of writing software I usually use  writing a book as analogy (or any type of writing). </p><p>I’ve heard and used others like building a house, but it doesn't quite cut it; the one that works almost perfectly is writing a book.</p><ul><li><p>Writing code -&gt; Writing the book.</p></li><li><p>Modules / Libraries / Components -&gt; Chapters, Episodes, Paragraphs (not 1:1 relation, just an idea depending) .</p></li><li><p>Code review -&gt; Peer review.</p></li><li><p>Compiling -&gt; Putting your peer's work and assembling the book.</p></li><li><p>Deploying -&gt; Send it to the print, or distribute it to the libraries.</p></li><li><p>SRE’s -&gt; The printer guys (or who help with the printers).</p></li><li><p>Bugs -&gt; Errata.</p></li><li><p>Versioning -&gt; Editions.</p></li><li><p>Refactoring -&gt; Change style or re-arrange the storyline so new characters can be included in the future.</p></li><li><p>Cloud computing -&gt;We’re renting someone else’s printer</p></li><li><p>Micro-services -&gt; Now will distribute the chapters instead of the full book.</p></li><li><p>Open source -&gt; We can include someone else’s IP in our books to write it faster.</p></li><li><p>Security fixes -&gt; A bit harder to explain but somehow the book shipped with something dangerous (a razor in extreme cases) and we have to remove them from all the libraries and put the old version while we figure out how that happened</p></li></ul><p>And the list goes on. </p><p>It’s fun.</p>\n",
      "url": "https://oscarryz.com/my-favorite-analogy-for-writing-code-is-writing-a-book.html",
      "date_modified": "2022-04-10T22:20:16.763Z"
    },
    {
      "id": "47639a10-a40e-11ec-b757-4b5dcc95651d",
      "title": "Finally this blog has autosave",
      "content_html": "<h1>Finally this blog has autosave</h1><p>It only took <a href=\"https://github.com/oscarryz/manu/issues/32\">me</a> (according to <a href=\"https://www.wolframalpha.com/input?i=March+14+2022+-+Sep+10%2C+2021\">Wolfram Alpha</a>) 6 months and 4 days.</p><p>I lost a couple of entries for postponing this feature so long, but not anymore!</p><p>It’s a bit embarrassing to be honest but that’s ok, this blog is more like a “if I ever have time” kind of project, so it doesn’t stresses me at all.</p><h5>14 mar 2022 #meta</h5>\n",
      "url": "https://oscarryz.com/finally-this-blog-has-autosave.html",
      "date_modified": "2022-03-15T03:22:55.937Z"
    },
    {
      "id": "411d6580-94c0-11ec-99f5-5d6a149ce6d2",
      "title": "The second year of remote work",
      "content_html": "<h1>The second year of remote work</h1><p>I’ve been working remotely for almost two years. </p><p>There has been a lot of <a href=\"https://oscarryz.com/a-year-of-remote-working.html\">good things about it</a>. Now in this second year I’ve noticed the main reason is the interaction I have with my team. </p><p>We’ve increased the social interaction we have; we talk more on 1:1’s, we stay longer after a meeting is over just to talk and socialize. The long-term effect is we have built trust in each other which helps when we have to solve work problems.</p><p> Our company has been very helpful in this regard, we have a budget for team events, and also we have a 1 hr per week mandatory game time (in addition to the existing ones) So, we use that time to connect.</p><p>Is very important to strengthen these connections specially when working from home and other kinds of social interaction are limited. It helps not only to do the work more efficiently but for our mental health. </p><p>Starting a conversation is much easier with a video conference. Staying longer after a meeting is easier too. There’s always the chat where we can just feel we’re not alone and we have established rules to use it properly (we use threads intensively and we summarize them when the conversation is done). There’s no need to find a conference room to get together and regardless, half of my team is 2hrs timezone difference anyway so we would’ve had to do a video conference regardless.</p><p>There has been a lot of stress about being in a constant lockdown. Many people are tired of doing so and just returned to “normality” which makes the whole pandemic last even longer. Yes, it’s hard, but we can make it easier by building connections online.</p>\n",
      "url": "https://oscarryz.com/the-second-year-of-remote-work.html",
      "date_modified": "2022-03-11T01:13:17.371Z"
    },
    {
      "id": "a4d839e0-7609-11ec-b0c2-2fa913c62b0b",
      "title": "Entertainment, the other use o",
      "content_html": "<h1>Entertainment, the other use of social media</h1><p>Jan 15 2022</p><p>If the first use of social media is to connect with friends, family, and people with similar interests, there's also another use for it; Entertainment.</p><p>The way we connect with other people on the internet in general (beyond social media) is limited in the way humans evolved to interact. We like to talk to each other, use our bodies to complement what we're saying, wave our hands, raise our eyebrows, roll our eyes! We also read the other people's body language and make adjustments. When we communicate through Social Media we can't do most of those things, we use text and it tends to be limited. Nobody wants to read a text wall, at least not to have a 1 on 1 conversation. Using video conferences has immensely helped, but we still need to improve the hardware (microphones, speakers, video quality, compression, etc.) to make it similar to a real-life conversation.</p><p>Given that 1 on 1 communication is not as fluid due to these limitations, internet communication evolved into entertainment. First was sharing jokes and then illustrating them as cartoons (soon after the meme would start). Videos make it easier to express ourselves and then we start looking more at our internet devices than TV. </p><p>TV shows and films are slowly decaying. They might always exist, just like we thought books would die but they are still around. But most of the show business has moved into the internet. And that even improved the entertainment we've got. It democratized the production of such entertainment, now all you need to start is a smartphone and a computer whereas before you had to knock on tv producers' doors or wait to be discovered. Even advertisements improved, we've got shorter targeted commercials (I know the targeted part is controversial, but at least they are not completely irrelevant).</p><p>Either way, it seems like the kind of entertainment we've got used to in the 20th century is going away and Social Media is taking its place. We have yet to see if it can finally be turned into a tool for good or it will keep dumbing us down as its predecessor. </p>\n",
      "date_published": "2022-01-15T13:47:13.406Z",
      "url": "https://oscarryz.com/entertainment-the-other-use-o.html",
      "date_modified": "2022-01-15T13:47:13.407Z"
    },
    {
      "id": "92f61d60-2be9-11ec-8cce-d3f0c71c4bce",
      "title": "Why do we use Social Media in ",
      "content_html": "<h1>Why do we use Social Media in the first place?</h1><p>In the early days of the internet, email was the main vehicle to share interesting content, photos, and memes (they were not called that yet).</p><p>The forums solved the problem of going beyond the close circle of people who had your email address. Even the introduction of upvoting posts solved the problem forums themselves brought: too much content!</p><p>But along this desire to connect and share with other humans came another very human trait: to be liked. Furthermore, when the platforms that are running ads next to the content noticed the more liked  a post is  more the revenue, they tweaked and fine-tuned the content up to the point where we no longer see just things other people with our similar interest share. We now see topics we were not even interested in initially. And the pushing for more viral content favors content that is in many cases divisive. </p><p>There have been some attempts to solve this problem. But whatever the solution is in the future, it will have to address what I think is the original intent of sharing with others while keeping in check the adrenaline that to be liked produces.</p><p>What else do we use Social Media if not for that?</p>\n",
      "date_published": "2021-10-13T05:51:13.462Z",
      "url": "https://oscarryz.com/why-do-we-use-social-media-in.html",
      "date_modified": "2021-10-13T05:51:13.463Z"
    },
    {
      "id": "21fe57c0-24b5-11ec-ab9d-efdcc5b89454",
      "title": "Learning a new language",
      "content_html": "<h1>Learning a new language</h1><p>It’s been a while since I learn a new language… the only other language I actually can say I know is English. <br /><br />I learned it in a very long period of time. I took classes for two months every 4-5 years and in each enrollment, I “untangled” all the misunderstandings I’ve built in the previous years. It concluded with a 6 months period of advanced classes (1.5 hrs every other day… a 7 am class ugh) Anyway, from then on I was certain I knew English (I’ve got a certificate saying I do) and didn’t really use it consistently for a while.</p><p>It was like with many other kinds of knowledge, it’s there, you use it once in a while. I used to read technical articles, and I started to ignore the subtitles in the American movies at some point, but not quite.</p><p>And then… I moved to the USA for a job, needless to say, it was a full English immersion , oh my.</p><p>On my first day on the job, everybody was very considerate knowing English was my second language, but the next day, they treated me like if I have been living there for years. Those were some difficult years I tell ya that. I could understand everything or mostly everything but it was hard to express myself with fluency especially in technical discussions when there were so many concepts, abbreviations (oh dear, American English, I’m not sure if the same happens in the UK but here we love to abbreviate everything in TLA, three-letter acronyms).</p><p> Binge watching all seasons of HIMYM helped… a lot.<br /><br />Then we have the inconsistency of written English, but to be fair, I learned the language had a hard uprising ( see more about that in the video <a href=\"https://www.youtube.com/watch?v=EqLiRu34kWo\">Why English Spelling is so Damn Weird</a> ).</p><p>Anyway, for months I pronounced things like “Ah-vo-kei-doh” for Avocado or “W-ee-nd” for \" Wind” without anyone correcting me, perhaps they were being courteous and patient with me. Also I kept using the sound “Jay” for the letter “Y” (as expected in a Spanish speaker) because nobody told me it doesn’t have the Jay sound, but an “I” sound. So here I am saying “jes” and “jellow” causing some chuckles. And don’t even get me started with the words Beach or Sheet, because I still double and triple check my pronunciation before uttering those two.</p><p>I solved those and many other problems with time and practice. And definitely I was fortunate to meet a language pathologist specializing in Accent Reduction, she had a meet-up to chat and correct these kinds of problems. Now with COVID the meetings are still happening virtually and she started a <a href=\"https://www.youtube.com/channel/UCtRQHJ9wrTvKPKpsTh6tnfQ\">YouTube Channel</a>. <br /><br />Today I can say my struggles with the language are not too different from a native speaker, I still have to check how a new word is pronounced and / or just ask people to repeat themselves if I don’t understand them. I think most of the time in English and dream from time to time when the dream has dialog in that language too, although my dreams are very abstract so, I’m not so sure language takes place there, but that’s a different post.</p><h3>Ah yes a new language</h3><p>Ehem, well I was going to post how now I’m learning a new language for the first time in years, and it turned into this semi-ranting about my struggles with English.</p><p>I started 24 days ago, to learn Dutch (!?) using Duolingo. Why Dutch? Well this post is already too long, I’ll just say it’s easier than German and more real than Esperanto.</p><p>The experience has been really pleasant so far and while I know it would take me years before I’m fluent the other day I had that moment of joy when I could identify some words by myself. And today I came up with a phrase while I was running: <em>Ik wil ga niet. </em>I checked it on Google Translate and it was correct (almost). I’ll probably write something more about that in the future. For now, I have to stop this and go and do my practice to keep my position in the Ruby league.</p>\n",
      "url": "https://oscarryz.com/learning-a-new-language.html",
      "date_modified": "2021-10-04T02:24:31.151Z"
    },
    {
      "id": "8a0e3660-2081-11ec-b638-15d12678a6a6",
      "title": "This is your life",
      "content_html": "<h1>This is your life</h1><p>Do what you love and do it often.</p><p>If you don’t like something, change it.</p><p>If you don’t like your job, quit.</p><p>If you don’t have enough time, stop watching tv.</p><p>If you are looking for the love of your life, stop; they will be waiting for you when you start doing things you love.</p><p>Stop over analyzing, all emotions are beautiful.</p><p>Life is simple. When you eat appreciate every last bite.</p><p>Open your mind, arms and heart to new things and people, we are united in our differences.</p><p>Ask the next person you see what their passion is, and share your inspiring dream with them.</p><p>Travel often; getting lost will help you find yourself.</p><p>Some opportunities only come once, seize them.</p><p>Life is about the people you meet, and the things you create with them so go out and start creating.</p><p>Life is short. Live your dream and share your passion.</p><p><a href=\"https://www.holstee.com/collections/all/products/holstee-manifesto-poster\"><em>The holstee manifiesto </em><strong>© </strong><em>2009</em></a><em>, </em><a href=\"https://holstee.com\"><em>Holstee.com</em></a></p><p><br /><br /></p>\n",
      "url": "https://oscarryz.com/this-is-your-life.html",
      "date_modified": "2021-10-04T01:05:26.846Z"
    },
    {
      "id": "e3b3d050-b414-11eb-a1e4-05b636d6a0bc",
      "title": "A year of remote working",
      "content_html": "<h1>A year of remote working</h1><h6>May 13, 2021</h6><p>I always wanted to do remote work, since the days I had to commute 4-5 hrs a day, every single day for years and years, the only thing I could think of was to move away from that. </p><p>Then I’ve got a job where I had to commute 10 minutes (20 total) it was like a dream. That’s all fine and good, absolutely no complaints there. I even started to ride my bicycle to the office and sometimes I walked. </p><p>Then the lockdown forced us to do remote work. I always wanted to try and even did some while having to be away from home for a couple of weeks, but I always heard about the perils of it; distractions, lack of boundaries, lack of communication. Fortunately for me none of that happened and was the opposite. I get distracted when there's a lot of conversations around me, I suffer from involuntary eavesdropping-ism :P aggravated by the fact, sometimes those conversations turn into important work-related information that was easy to miss if you're not paying attention constantly. Also, I liked to stay after office hours to play a few games to decompress but more than once I stayed way longer than I should. That's all gone with the remote work. </p><p>Now I wake up and I'm at my desk in ... well less than a minute. Also, the communication has improved as all the work-related information has to be delivered by e-mail or chat, or in a conference call and you're explicitly summoned and waited for, and if you're gone for that day there's usually a way to catch up. So during the day, I'm able to focus on my work. If I have a question I can ask or call one of my coworkers without having to check if they're at their desk. If they're not available they'll reply eventually, or if busy they just won't reply. Unlike the person to person where it's a bit awkward when someone is busy and can't help you at the moment or the other way around, you're busy and someone shows up at your desk and you feel bad to tell them you’re busy. Now you just put your do-not-disturb sign the the chat. As for drawing the line between work / home times, we have been very good at saying good night at the end of the day so there's a clear boundary when you have to stop working. </p><p>Do I miss the social interaction? Yes. A bit, but I realized I was the reserved type anyway, or rather, I'm fine being reserved. </p><h3>Next step?</h3><p>Now I know we're living in exceptional circumstances, but can't help to imagine a time where remote work is the norm and you can live anywhere. I'm starting to daydream about living in other countries, one month at a time. Working during the week (albeit in probably weird hours due to the timezones difference) and  during the weekend get to visit the surrounding area. </p>\n",
      "url": "https://oscarryz.com/a-year-of-remote-working.html",
      "date_modified": "2021-05-13T21:11:27.183Z"
    },
    {
      "id": "d0f14f50-a844-11eb-b2cf-bb640f6f2694",
      "title": "Things will not always go well",
      "content_html": "<h1>Things will not always go well though</h1><h6>April 28 2021</h6><p>Sometimes things that are not under our control will go bad, which is already hard to deal with but to some degree easier to get over, they weren’t our fault after all. But when things that are under our control go bad the feeling is terrible. We should remember not to be too harsh with ourselves in those situations either, this is how life is.</p><p>Better is to recognize the mistake as soon as possible, it might be hard especially when the ego is involved. Also as soon as we admit the responsibility for the fault it’s very useful to try to find out what’s the underlying reason for the mistake instead of just degrade ourselves thinking we are stupid or worthless, that’s not helpful at all.</p><p>Eventually, things will turn around, they always do, the trick is to try to create the conditions for the good things to extend as much as possible and endure the bad times while they last, learn from the mistakes, and move on. Easier to say than do of course.</p><p><br /><br /><br /></p>\n",
      "url": "https://oscarryz.com/things-will-not-always-go-well.html",
      "date_modified": "2021-05-13T20:19:14.312Z"
    },
    {
      "id": "b36473c0-8d7f-11eb-9cce-b9cbcc929643",
      "title": "The best time of my life",
      "content_html": "<h1>The best time of my life</h1><p>I have been very fortunate and many ways, and this lockdown has given me opportunities I never had before, namely work from home.</p><p>At the end of the workday, I just walk out of the room I use as an office and I’m instantly at home, my commute was already good, but at some point in my life it was taking me up to 3 hrs each way, needless to say, I switched jobs.</p><p>There are some distractions having the family so close, but I would argue there were some (albeit different) distractions in my workplace when people around start chatting (even if it was work-related). At home, we have managed to keep the distractions at a minimum and my employer has been awesome in allowing us to have extra time off when required during these special circumstances.</p><p>My family is healthy, I am healthy although I had recently spent some time in the hospital due to what I thought was a stroke, which turned to be a number of things combined (migraine, arm numbness) that looked like one. I’m glad to know it wasn’t as serious but definitely gave me the wake-up shake that I needed to go back and being active and eat healthier.</p><p>I have found love, and what an awesome person did I find. Sometimes when there is some struggle I tell her “Well don’t blame me, I chose wisely, you not so much” but of course I try to improve on whatever we were struggling with, for instance among other things, cook more often, who would’ve thought cooking was so easy and rewarding. <br /><br />Anyway, I know I’m really privileged and there are a lot of people that are struggling. Yet I think it’s important to stop for a second and be grateful for what you have and enjoy the moment and this is what this post is all about.</p>\n",
      "url": "https://oscarryz.com/the-best-time-of-my-life.html",
      "date_modified": "2021-03-25T16:00:53.749Z"
    },
    {
      "id": "ad06b5d0-6596-11eb-9cce-b9cbcc929643",
      "title": "Social Networks power",
      "content_html": "<h1>Social Networks power</h1><p>There have been some concerns about how much power do social networks have, and if people should abandon them or not, and also move to where exactly.</p><p>Some other voices disregard these concerns with “Well they already know everything about me” or “Social Networks only care about famous people, not simpletons like you”. None of these arguments are valid.</p><p>I don’t think that’s the problem here. It’s very unlikely and impractical to try to go back to a previous era where these things didn’t exist. Some communities have tried to isolate themselves from modern society and the problems it brings (I think about the <a href=\"https://en.wikipedia.org/wiki/Amish\">Amish</a>), but let’s be realistic, that’s not going to happen.</p><p>I’m not sure if I’m just getting older and wiser but, I’ve seen this before, with the T.V. while the differences are notable the same principle can be followed; educate yourself and your family on how much exposure is healthy, how many hours do you need to be on the device (t.v., or phones, or in this case Social Networks), and how much is too much. Another example is any kind of addiction if you stop doing X activity for spending all your time doing Y, you have an addiction problem.</p><p>So I think it’s a matter of education, I see in the future kids will get a class on social media just like today (most) get Sexual Education.</p><p>So, don’t abandon them or move to some other platform. They are a very good tool if used properly (never before like today we’ve been able to get so much information so quickly or to be face to face with someone in an instant just like we used to see in the SciFi shows in the ’80s). Treat them as you would treat a stranger (because that’s exactly that it is, a window for a stranger to peek in your life), don’t overshare your life, don’t share your personal information, don’t tell them who your family is and all your details to someone you don’t even know.</p><p>Yes, they need to be regulated and it will take some time before that happens, in the meantime, keep using them wisely to keep in contact with your friends and family for that’s what I think is the best use of them.</p>\n",
      "date_published": "2021-02-02T20:38:58.733Z",
      "url": "https://oscarryz.com/social-networks-power.html",
      "date_modified": "2021-02-02T20:38:58.735Z"
    },
    {
      "id": "8ec8ba80-2f79-11eb-ad7e-bfb0df3ce950",
      "title": "Good intention does not exempt",
      "content_html": "<h1>Good intention does not exempt from consequences.</h1><p>When we do or say something we are still responsible for the effect it has on others, even if our intention was good. On the other hand, when someone else says or does something that results harmful or offensive to us, we have to speak out and let them know, as most of the time they didn’t mean bad for us.  </p><p>When this situation happens both parties have to be open and receptive to what the other has to say, why they did it in the case of the one offending, and how it was received in the case of the offended; that way they both learn and grow and adjust their values and reduce friction. </p><p>All of this sounds very obvious and it’s common sense, but until we have to put it into practice it’s hard to understand and particularly difficult to realize it’s happening when we are the offending side. What we think is obvious might not be for others. And while we can say: “Oh I did it with the best intention” might still have a negative impact. </p><p>As always a good dose of patience and will is required to make this good communication happen.</p>\n",
      "date_published": "2020-11-25T23:54:29.804Z",
      "url": "https://oscarryz.com/good-intention-does-not-exempt.html",
      "date_modified": "2020-11-25T23:54:29.808Z"
    },
    {
      "id": "f63fc9d0-1302-11eb-ad7e-bfb0df3ce950",
      "title": "Where does the money come from",
      "content_html": "<h1>Where does the money come from?</h1><p>I was trying to reflect on the origin of the money, and after a while, I realized I have no idea. <br /><br />There are goods and services, you pay for them with money you earned doing some other things (probably selling goods and services too), on a lower layer there’s manufacturing, having build supplies and applying human labor. </p><p>That human labor ultimately came from the ground, as food, which in turn makes them come from the Sun 🤔. </p><p>And then there’s a layer on top which are digital goods (just think how much did Google earned by “selling” screen pixels). </p><p>So, it seems all this money is moving from the Sun to digital services in a pyramid scheme? </p><p>I wonder if there’s another explanation.</p><p><br /></p>\n",
      "date_published": "2020-10-20T18:35:00.720Z",
      "url": "https://oscarryz.com/where-does-the-money-come-from.html",
      "date_modified": "2020-10-20T18:35:00.721Z"
    },
    {
      "id": "e870d770-f7fc-11ea-ad7e-bfb0df3ce950",
      "title": "No keyboard, less entries",
      "content_html": "<h1>No keyboard, less entries</h1><p>I usually write at night when I have these ideas floating in my head. Unfortunately due to unexpected circumstances my Chromebook's keyboard stopped working (well not exactly “unexpected”, but I'm too embarrassed to explain how spills happen). Because of that I'm writing less.</p><p>The other reason is because I'm starting to get self conscious of what I said because I might have an audience (albeit small) and started to care what they would think, which is sad, because I shouldn't</p><p>But mostly is because of the keyboard (and the sub optimal support for mobile in this blog “engine”)</p><p>Now I'll click on “Save” and see what happens.</p>\n",
      "url": "https://oscarryz.com/no-keyboard-less-entries.html",
      "date_modified": "2020-09-16T09:18:05.362Z"
    },
    {
      "id": "4bc16360-e59e-11ea-ad7e-bfb0df3ce950",
      "title": "Sunday",
      "content_html": "<h1>Sunday</h1><p>It's 35C outside. I hung a hammock, pour a beer and turned on the fans. Took a nap for about good 20 minutes.</p><p>I'm waiting for the Ragú to finish its mandatory 2hr slow cook, so technically speaking I'm cooking.</p><p><br /></p><p>Now I'm hungry and the good news is it will only take 15 more minutes to have dinner ready</p>\n",
      "url": "https://oscarryz.com/sunday.html",
      "date_modified": "2020-08-24T07:53:13.874Z"
    },
    {
      "id": "f9caceb0-dd33-11ea-ad7e-bfb0df3ce950",
      "title": "Star gazing",
      "content_html": "<h1>Star gazing</h1><h5>August 13th, 2am</h5><p>It took me three days but finally today I was able to watch shooting stars.</p><p>I grew up in a place where going out after 8pm requires you to wear a sweater, no matter the time of the year, and definitely at least three layers after midnight. Now I live in Texas and my brain struggles to understand it's 30C (86f) at 2 am. I for one am glad as I could pull a chair in the garden and layback to watch the sky.</p><p>Now, when they say “meteor shower” what comes to mind? Meteorites falling as rain, am I right? Nothing even close. But definitely much more than what one could expect to see by just turning your head up to the sky.</p><p>It's a fun experience, at the beginning it's confusing, you're there and absolutely nothing happens. Then the night sounds started to freak me out, the wind blowing in the trees, the crickets, the creaking on the neighbor fence, and even the AC turning on and off make me wanted to run back into the house. Then it hits me, all of these things still happen without me while I’m sleeping. These night things welcome me into their world by just ignoring me and accepting me as I am.</p><p>So I relax a bit and start to feel comfortable, but still nothing happens. Then there it is! A first shooting star, although I immediately start wondering if I imagined it, it was way too brief and too dim, nothing like some others I’ve seen before. Oh well.</p><p>20 minutes in, check my phone app to see (for the 10th time) where the perseids are located and while I’m moving my sight into the screen I see another one, very clear! very bright!. Ok ok, put the phone away and get ready to be amazed by the rest of the stars. Nothing happens.</p><p>So, things start getting a bit uncomfortable, I’m wearing pants and a long sleeve in 30c (86f) weather due to the mosquitoes, so I’m sweating a bit. My hands (the only uncovered part besides my face) start getting a bit itchy, a mosquito must have found it’s way there. I’m starting to worry about the possibility of having the chair in the middle of an ant “house”, and I’ve just seen 1 1/2 star.</p><p>“Come on! where are they?” I ask myself knowing (but not accepting) that I need to be patient. I take a conscious deep breath and realize all of this is part of the experience, the being in the middle of the yard , in the dark, my head leaning back. So I cover my hands a bit more, lay back and enjoy the moment. I hear the same night sounds but now they’re just like a lullaby, the cracking on the fence it’s not scary anymore, it’s just a rhythmic sound. The wind on the trees, which is a sound I adore in the day, it’s even delightful in the night. I hear some dogs barking very far away and I compare them to those where I grew up. There are some other sounds whose source I cannot fully detect but they’re fine I stop trying to figure out where they come from.</p><p>40 minutes in and finally I stopped trying to make things happen just because I want to. They’ll just happen when they have to. I just have to be present. So I start preparing my wishes for the upcoming stars as I know they’ll show up. And a few minutes later there was one, and another, and another. Some of them dim and shy, that last one I saw, about the brightest I’ve ever seen, 4 seconds crossing the sky.</p><p>One hour after and many wishes for all my loved ones after, I walk back to the house. The moon is about to show up and Illuminate the sky. Went  into the house and enjoyed all the other things that sleep in there.</p><p>This has been a very nice star gazing night.</p>\n",
      "url": "https://oscarryz.com/star-gazing.html",
      "date_modified": "2020-08-13T17:29:52.172Z"
    },
    {
      "id": "85e60ea0-dccb-11ea-ad7e-bfb0df3ce950",
      "title": "Physical Work",
      "content_html": "<h1>Physical Work</h1><p>It may seem obvious, but I think it’s important to remember how hard physical work is. </p><p>In a modernized world, it’s easy to take granted things farming, mining, construction, or even more mundane activities like mowing the lawn or cleaning the house. But we have been doing physical work since the beginnings of human history.</p><p>Physical work dignifies and envigorates; there is something about it that is different from say, training or working out. Seeing the final product and get tired at the end of the day seems a bit of a reward in itself.</p><p><br /></p>\n",
      "date_published": "2020-08-12T18:42:07.114Z",
      "url": "https://oscarryz.com/physical-work.html",
      "date_modified": "2020-08-12T18:42:07.114Z"
    },
    {
      "id": "d5030480-da13-11ea-ad7e-bfb0df3ce950",
      "title": "Continuous improvement",
      "content_html": "<h1>Continuous improvement</h1><p>I’m really impressed by people that do <strong>A LOT</strong> of work; think of someone that has written an 8 series book or ran an <a href=\"https://en.wikipedia.org/wiki/Ultramarathon\">ultramarathon</a> or learned all Chopin’s piano pieces, all of them.</p><p>The common trait all of these people have is perseverance and consistency, these milestones are more often than not achieved through continuous and consistent work. Of course, natural ability makes it easier but that just takes you so far. This daily work combined with analysis to remove deficiencies creates a continuous and constant improvement that eventually develops into mastery.</p><p>But how do you get this consistency? How you force yourself to do something <em>every day?</em> You just do it? Are you forced by an external force (your parents when you’re a child and then your obligations when grown-up?). I think I know the answer, I think I’ve always had. But it’s slightly different to know the path and walk the path.</p><p>I can also just sit here comfortably and see if an alternative method appears all of the sudden in front of me.</p>\n",
      "url": "https://oscarryz.com/continuous-improvement.html",
      "date_modified": "2020-08-09T08:31:46.623Z"
    },
    {
      "id": "103d43e0-d572-11ea-ad7e-bfb0df3ce950",
      "title": "Always learning",
      "content_html": "<h1>Always learning</h1><h6>Aug 3rd, 2020</h6><p>We are like no other specie, always curious about our surroundings, we are from a few weeks after being born, always trying to learn and understand how things work. Probably this curiosity slows down as we get older, but as far as I’m concerned I’m still trying to learn as much as possible.</p><p>This trait has been exploited by the current state of the Internet, specifically \"Social Media”, we are always trying to find more information everywhere and these companies are pushing content we were not even interested on in the first place, and we, animals of habit find hard to disregard them.</p><p>And yet, we keep eager to learn new things, it just seems there are no suitable tools to enable us to satisfy this curiosity without turning us into mindless manipulated entities. Some tools like note-taking apps and knowledge tools come to mind (Notion, Evernote, Google Docs), even things like creating your own blog to preserve your thoughts (like I’m doing with this one) might help, but they will never be as easy as going to _____ app and scroll infinitely just looking for another spike of dopamine.</p><p>There most be a way of course. Probably it’s just as simple as turning off the device and see the world around us. But we are probably afraid to think that without “likes” and “follows” we are all alone.</p>\n",
      "url": "https://oscarryz.com/always-learning.html",
      "date_modified": "2020-08-03T10:21:31.910Z"
    },
    {
      "id": "c92dbf30-d0e8-11ea-ad7e-bfb0df3ce950",
      "title": "English is not my native langu",
      "content_html": "<h1>English is not my native language</h1><p>So, if you spot a grammatical error here, please send me a message and I’ll fix it.</p><p>I’m currently in that weird spot where my thoughts are in English, I feel more comfortable speaking it and yet, I make some silly mistakes. </p><p>The worst part is sometimes when I switch to my native I run out of words too.</p>\n",
      "date_published": "2020-07-28T15:41:21.443Z",
      "url": "https://oscarryz.com/english-is-not-my-native-langu.html",
      "date_modified": "2020-07-28T15:41:21.443Z"
    },
    {
      "id": "05c92440-cfc0-11ea-ad7e-bfb0df3ce950",
      "title": "Why should we try to be a better person",
      "content_html": "<h1>Why should we try to be a better person</h1><p>Why? Is it because if we don't try, we drift to worsen? What defines what's better or worse? Is it subjective? Cultural? A social construct?</p><p>Assuming the meaning of life if to enjoy it, the better we are, the better the opportunities to enjoy it will be.</p><p>For example, let's take sleeping all day long; we can argue that's something enjoyable and thus a good thing to do, but by doing it in excess, we would miss chances to do something else. In this case, not sleeping all day would make us better. What if, we insist, that sleeping is what we want to do. In that case, that wouldn't be a problem and would be the rare case of someone who found what they want to do for the rest of their life. The reality, however, is not that simple. We need to do something else (go to work to buy food, make food, eat, etc.).</p><p>That's why good habits, like sleep well, healthy food, exercise, among many others, are deemed as good things as they enable us to enjoy life better, a healthy, well-slept body will enjoy a sunset better than one with sleep deprivation.</p><p>When we become self-sufficient, we enable ourselves to give us more opportunities to enjoy life (making yourself your favorite food is an example).</p><p>That's why I think we should try to be better persons because, in the end, it benefits ourselves. It seems so obvious isn’t it?</p><p>We don't get better overnight though it takes time to develop these skills and habits, hence the improvement is always an ongoing gradual process. There's no rush, but there's no reason to delay it either.</p><p>More often than not, the things we do to be better are also themselves the reward to enjoy life.</p>\n",
      "url": "https://oscarryz.com/why-should-we-try-to-be-a-better-person.html",
      "date_modified": "2023-11-15T15:34:53.789Z"
    },
    {
      "id": "9bec8ae0-c93d-11ea-966a-0332a7d703ce",
      "title": "Choose to remember",
      "content_html": "<h1>Choose to remember</h1><p>Never like before we have had the opportunity to capture our experiences as we go.</p><p>We have devices (phones but they are not really \"phones\" anymore) where we can capture video, take photos and write notes at any given time.</p><p>The problem is these devices are also a distracting tool that alienates us from living the present moment.</p><p>Still, the ability to capture memories overweights the downsides. However, a tool to better organize these memories in a way the human brain does is still needed. It's not a very complex problem, but not trivial.</p>\n",
      "date_published": "2020-07-18T21:28:23.439Z",
      "url": "https://oscarryz.com/choose-to-remember.html",
      "date_modified": "2020-07-18T21:28:23.440Z"
    },
    {
      "id": "6e161ca0-c68e-11ea-90e2-ffb7e57b375c",
      "title": "How to get to sleep",
      "content_html": "<h1>How to get to sleep</h1><h6>July 15th, 2020</h6><p><em>Guarantee to work… almost</em></p><ol><li><p>Think of a fond memory of yours; it could be a trip, a childhood memory. Pretty much anything.</p></li><li><p>Try to remember the details, how did you get there, what happened the day before or a few moments earlier.</p></li><li><p>Remember the details of the event and let it flow into what happened next. Recreate it in your mind.</p></li><li><p>Remember who you were with, details about the place. What became of those people? What other memories do you have about that place?</p></li><li><p>Finally, stop trying to control the memories and let it flow.</p></li></ol><p>This works for me almost all the time. I find that while trying to remember those things I usually start dreaming about them and eventually fall asleep. Also, I stop thinking about other topics which are usually the reason why I can’t sleep in the first place. <br><br>And if it doesn’t work at least I’ve had a good time reliving those memories that otherwise get lost in the business of the everyday.</p>\n",
      "url": "https://oscarryz.com/how-to-get-to-sleep.html",
      "date_modified": "2020-07-17T05:03:25.886Z"
    },
    {
      "id": "2364d850-c4f3-11ea-8106-5948db66e7b8",
      "title": "Online discussions",
      "content_html": "<h1>Online discussions</h1><p>Just like in real life, discussions are better when they are personal, with someone you know and when the parts already know how to have a civil discussion.</p><p>Otherwise, they are just a waste of time really. Sometimes is worth trying but bear in mind you won’t change someone’s mind, when that someone has a preconceived idea.</p><p>Obligatory <a href=\"https://xkcd.com/386/\">xkcd</a></p>\n",
      "url": "https://oscarryz.com/online-discussions.html",
      "date_modified": "2025-02-27T12:45:22.523Z",
      "date_published": "2025-02-27T12:45:22.523Z"
    },
    {
      "id": "4f90b510-c3d7-11ea-9f72-413aa35f893d",
      "title": "It’s not just about happiness though",
      "content_html": "<h1>It’s not just about happiness though</h1><h5>July 11th, 2020</h5><p>We cannot pretend, however, that we can be <a href=\"/happiness.html\">happy</a> all the time. We are very complex creatures and we can have all sorts of emotions even when they seem contradictory, especially in times like these.</p><p>While is desirable to strive for happiness, it’s important to recognize and accept we can also be fearful, scared, anxious, etc. There’s nothing wrong with that. In the past , society has enforced stereotypes in which only the positive should be promoted and the negative suppressed. This is <a href=\"https://www.google.com/search?q=toxic+positivity\">toxic positivity</a> and even when well-intentioned it causes more damage than what it tries to help.</p><p>These “negative” feelings are also part of ourselves, and we cannot just ignore them and push them aside. For one, that would be denying our own human nature; secondly, they will find their way in sometimes unpredictable ways, and finally, they’re there for a reason, either to create awareness of our surroundings, serving as an alert, to stop doing something that’s damaging us, or enabling us to feel empathy and create a connection with others.</p>\n",
      "url": "https://oscarryz.com/its-not-just-about-happiness-though.html",
      "date_modified": "2025-04-08T20:36:40.699Z",
      "date_published": "2020-07-12T06:12:44.182Z"
    },
    {
      "id": "b050b170-c026-11ea-b8f8-d52ffa796a70",
      "title": "Happiness",
      "content_html": "<h1>Happiness</h1><h6><strong>Jul 6, 2020</strong></h6><p>Happiness is not quantifiable, like money or time. You cannot say I have X amount of happiness.</p><p>Happiness is an absolute, you're happy and that's it! You cannot be more or less happy, the perceived amount of happiness is perhaps the amount of continuous-time you feel it (oftentimes manifested as Joy) but there are all kinds of sources of happiness; when you eat your favorite meal, when you had a good night of sleep, when you see a beautiful sunset, when you see the eyes of the person you love.</p><p>Some of the sources of happiness are quite obvious, like joy after a good laugh, but many of them are subtle and almost hidden everywhere else, like that warm feeling of a blanket on a cold night.</p><p>And this is the real meaning of life, this is why we're here for, to find and link together all these sources and keep the streak as long as possible.</p>",
      "date_published": "2020-07-12T00:12:07.202Z",
      "url": "https://oscarryz.com/happiness.html",
      "date_modified": "2020-07-12T00:12:07.202Z"
    },
    {
      "id": "25e7d2f0-bd4e-11ea-b8f8-d52ffa796a70",
      "title": "About this blog",
      "content_html": "<h1>About this blog</h1><h5>Jul 1st, 2020</h5><p>It's just a place to write my extended thoughts about life (mainly digital life atm), inner replies to a post I read somewhere else, and yes, to reclaim my web presence and own my content among this sea of social networks, memes, cloud solutions, and whatnot.</p><p>What's funny is I tried to blog several times since forever, I have a Blogger account, a Medium account, even a <a href=\"https://proseful.com/\" title=\"Proseful\">Proseful</a> account. Never posted anything beyond the “hello world”.</p><p>I wasn't until I built this blog “engine” myself from the ground up that I get to use it, and I mean, really built it, no Gatsby, Jekyll, or static generators. Pure string concatenation (not saying this is good, but wanted to experiment how to do it).</p><p>There's no likes, analytics, comments, share button or alike (maybe I'll add those later). Just a link to my twitter in case someone wants to DM a reply, but that's not the intention.</p><p>I have it as a (really messy) <a href=\"https://github.com/oscarryz/manu\" title=\"Manu in Github\">open source project</a> and keep learning while I build it (e.g. yesterday added support to toggle dark mode).</p><p>There's something special about crafting your stuff, I guess similar to when we used to build our bows and arrows; if they suck you suck, but you can go home and improve them. When they work you feel proud. That's something we've lost in our technological evolution and yet so innate to human nature, it still finds its way in such an abstract world like the Internet.</p>",
      "date_published": "2020-07-04T17:02:38.966Z",
      "url": "https://oscarryz.com/about-this-blog.html",
      "date_modified": "2020-07-04T17:02:38.966Z"
    },
    {
      "id": "903765e0-bcdf-11ea-9599-d74d386fe755",
      "title": "Curating social media",
      "content_html": "<h1>Curating social media</h1><h5>July 2nd, 2020</h5><p>There’s&nbsp;<a href=\"https://www.indiehackers.com/post/antisocial-media-60ebd9250e?commentId=-MAm-HJB318OskEhU6mZ\">this post</a>&nbsp;on indie hackers about how social media is currently more about trying to get people’s attention to what you think they might like:</p><blockquote><p>&nbsp;<em>On Facebook, you show others what you think they'll like. You spend time picking the best photo, edit your text to be snappy, agonize over the feedback you&nbsp;<strong>might</strong>&nbsp;get[…] I think that could be a remedy for the ills of social media - antisocial media. Time with oneself. Curating an environment... for you.</em></p></blockquote><p>A similar topic was addressed in this blog&nbsp;<a href=\"https://manuelmoreale.com/websites-and-complexity\">Websites and complexity</a>:</p><blockquote><p><em>At the same time though, it makes me kinda sad to see people giving up ownership of their web presence. Personal websites are a mirror of the human beings behind them.</em></p></blockquote><p><br>Makes me wonder; How many of the 2.2 billion (2,200+ million) users of Facebook are interested in customizing their profile and content to make it truly unique? I guess that many, I mean most of us don’t even post original content, we just repost what someone else’s did.</p><p>I know&nbsp;carrd.co&nbsp;offers a service to create your own web page. Let’s do a Google search. Oh wow,&nbsp;<a href=\"https://www.google.com/search?q=site:carrd.co\">200k results</a>!! That’s quite a number. I guess there’s some interest after all.&nbsp;<br>That’s still the 0.01 percent&nbsp; of the Facebook users, but then again, how many of them know about carrd.co?</p><p>The other aspect people might be interested on, is curating the content (not so much the appearance of the site) to keep track of their thoughts, photos, memories. Personal things. I don’t think there’s much out there except for all those note-taking apps and document management. Let’s see.</p><p>According to&nbsp;<a href=\"https://expandedramblings.com/index.php/evernote-statistics/\">this site</a>, there are 225 million Evernote users (obviously many of them are probably inactive, like the account I created years ago) that’s about 11 percent of Facebook users. Not bad at all.</p><p>Well it looks like people are indeed interested. It’s just mainstream social media is more prevalent and easier to use.</p><p>So, it seems people are willing to curate their content and tune the appearance of their profiles/sites after all.</p><p>Certainly, a topic to keep researching on.</p>",
      "date_published": "2020-07-03T05:15:16.201Z",
      "url": "https://oscarryz.com/curating-social-media.html",
      "date_modified": "2020-07-03T05:15:16.201Z"
    },
    {
      "id": "597485a0-bc22-11ea-ab34-5981abea15dc",
      "title": "Ideas",
      "content_html": "<h1>Ideas</h1><p>You have an idea.</p><p>The idea doesn’t do anything, it’s just sitting there buzzing around your head.</p><p>Sometimes you speak out the idea. It becomes noise. Then if there’s someone around you and hear the idea they might like it and now they can use it, or just ignore it.</p><p>If the idea is not written down, it might be forgotten. If the idea is repeated out loud may shape into other ideas.</p><p>But ideas never turn into anything else if they are not put in practice.</p><p>I had an idea 10 years ago. Never did anything with it. Recently someone asked me:</p><p><em>“Hey, do you have a spare idea you’re not using?”</em></p><p>And suddenly I felt like using it again. I shared it. I created something with it (a drawing), now that idea is a drawing, until I turn it into something else.</p>",
      "date_published": "2020-07-03T02:54:11.298Z",
      "url": "https://oscarryz.com/ideas.html",
      "date_modified": "2020-07-03T02:54:11.298Z"
    },
    {
      "id": "cd3b3950-babc-11ea-9080-e9046fc766e8",
      "title": "A Social Network without",
      "content_html": "<h1>A Social Network without</h1><h5>30 June 2020, 5:20 am</h5><p>Imagine a social network without advertisement</p><p>That doesn’t profile you</p><p>With no Likes or Followers</p><p>Without distraction machinery to make you crave for more</p><p>What you have left is what really matters, your own stories, your own memories, your own connection.<br><br><br><br><br><br><br><br><br><br><br></p>\n",
      "url": "https://oscarryz.com/a-social-network-without.html",
      "date_modified": "2020-07-13T10:21:20.566Z"
    },
    {
      "id": "8640d660-9b70-11ea-8bb7-b3f8e9efdb6d",
      "title": "r/manuelmoreale",
      "content_html": "<h1>r/manuelmoreale</h1><h5>May 21st 2020</h5><p>Thoughts on this manuemoreale’s blog <a href=\"https://manuelmoreale.com/on-random-interactions\" title=\"this post\">post</a>.</p><p>Mass social media (Facebook, Instagram, Twitter, et al) certainly creates a disconnection between what’s important in human communication in favor of advertisement and popularity. But they also offer a way to communicate with the OP.</p><p>There are alternatives to this, of course, the most basic is to add a comments section on the blog, but seems inadequate (had to create accounts, moderate, etc) and it might just not fit the blog style.</p><p>Another is to let the interested party (the audience) create a blog/site of its own and post the reply there (just like I’m doing now) but that’s not trivial at all, and it was already addressed <a href=\"https://manuelmoreale.com/websites-and-complexity\" title=\"\">previously here</a>.</p><p>Maybe a new type of platform is needed. Probably this not-knowing-each-other is a good thing in some extent, but in the meantime, I’m still adding this reply here.</p><h3>Or Reddit…</h3><p>Or, I can use another platform such as Reddit which is … well it’s reddit.</p><p>Let’s see how that goes.</p><p>The idea is to create <a href=\"https://www.reddit.com/r/manuelmoreale\" title=\"\">r/manuelmoreale</a> and then for every post on the blog, create an entry on the subreddit where the audience can comment.</p>",
      "date_published": "2020-07-02T05:02:22.209Z",
      "url": "https://oscarryz.com/r-manuelmoreale.html",
      "date_modified": "2020-07-02T05:02:22.209Z"
    },
    {
      "id": "e6652020-5eb5-11ea-899e-37f41fb5f8ad",
      "title": "The need for owning your blogging platform",
      "content_html": "<h2>The need for owning your blogging platform</h2><h6>March 05 2020</h6><p><em>In reply to </em><a href=\"https://www.indiehackers.com/codemysoul\"><em>@codemysoul</em></a><em> post on </em><a href=\"https://www.indiehackers.com/post/new-way-of-blogging-da65509db8\"><em>this IH post</em></a></p><p>I personally don't blog that often (or if at all) The thinking of having to conform to \"conventional\" practices and adhere to certain style creates a bit of anxiety in me. What if what I'm writing is seems boring? What if my grammar is terrible? What if the content is all over the place?</p><p>Fortunately I came across this blog <a href=\"https://manuelmoreale.com/\">manuelmoreale.com</a> which is a great source of inspiration for a different type social media content. Way simpler, no SEO goals, personal.</p><p>So, as a way of applying what I've learned reading IndieHackers conent, about creating and MVP and keep it minimum,  I created a clone of <a href=\"https://manuelmoreale.com/\">manuelmorale.com</a> blog, but this one could be edited <em>in situ</em>. Unfortunately I also wanted to experiment with \"extreme\" serverless-ness and the editor only runs locally and publishes the generated static site, so no online demo, only the final output: <a href=\"https://oscarryz.com/\">https://oscarryz.com/</a></p><p>So that's my MVP for the goal to create something for myself.</p>\n",
      "url": "https://oscarryz.com/the-need-for-owning-your-blogging-platform.html",
      "date_modified": "2025-01-16T12:11:21.891Z",
      "date_published": "2020-05-22T03:17:35.467Z"
    },
    {
      "id": "0ccfe070-5eab-11ea-857b-ed3954ab3a20",
      "title": "Creating a simplistic blogging",
      "content_html": "<h2>Creating a simplistic blogging platform</h2><h6>MARCH 4, 2020</h6><p>That was the goal of this project; create a simple way to create blogs where you can just start writing directly into the blog instead of having to go through a complex application or have to write in a weird format and then transform the blog somehow, like you do with static site generators.</p><p>The idea while good, turned out to be (as many things in software development) easier to say that actually execute. It wasn’t particularly hard, just a little bit cumbersome, mostly due the lack of time.</p><p>So, taking as “inspiration” the&nbsp;<a href=\"https://manuelmoreale.com/\">https://manuelmoreale.com/</a>&nbsp;blog, we came up with this “design”:</p><p><img src=\"https://raw.githubusercontent.com/oscarryz/manu/master/etc/Editor-View.png\" alt=\"Editor view of the blog platform\" title=\"Manu blog platform\" contenteditable=\"false\" draggable=\"true\">Which is basically the same ui but adding an editor bar to create new entries, edit them and publish them.</p><p>I’ll keep documenting the approach we took to write this down and how far we’ve got. This right here is the first entry on the working platform, and while still far from complete is now usable.</p>",
      "date_published": "2020-05-22T03:16:45.372Z",
      "url": "https://oscarryz.com/creating-a-simplistic-blogging.html",
      "date_modified": "2020-05-22T03:16:45.372Z"
    }
  ]
}